#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_FishingRod

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_FishingRod.ABP_FishingRod_C.AnimBlueprintGeneratedConstantData
// 0x01DF (0x01E0 - 0x0001)
struct ABP_FishingRod::FAnimBlueprintGeneratedConstantData final  : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_3DEA[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_385;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_386;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_387;                                // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_388;                                 // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_389;                                // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_390;                                // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_391;                                // 0x002C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_392;                                // 0x0034(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_393;                                 // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_394;                                // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_395;                                 // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_396;                                // 0x004C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_397;                                 // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_398;                                // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_399;                                 // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DEB[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_400;                                // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_401;                                  // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_402;                                // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_403;                                // 0x0079(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DEC[0x6];                                     // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_404;                               // 0x0080(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_405;                                // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_406;                                 // 0x0098(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_407;                                // 0x009C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_408;                                 // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_409;                                // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_410;                                 // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_411;                                // 0x00B4(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_412;                                 // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_413;                                // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_414;                                 // 0x00C8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_415;                                // 0x00CC(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DED[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_416;                               // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_417;                              // 0x00D4(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_418;                               // 0x0100(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_419;                                // 0x0104(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_420;                                // 0x0105(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_421;                                // 0x0106(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DEE[0x1];                                     // 0x0107(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_422;                                // 0x0108(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_423;                                 // 0x0110(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DEF[0x4];                                     // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_424;                              // 0x0118(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_425;                                // 0x0138(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_426;                                // 0x0140(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0148(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01C8(0x0018)()
};
static_assert(alignof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_FishingRod::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData) == 0x0001E0, "Wrong size on ABP_FishingRod::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __NameProperty_385) == 0x000004, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__NameProperty_385' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __IntProperty_386) == 0x00000C, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__IntProperty_386' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __NameProperty_387) == 0x000010, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__NameProperty_387' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __IntProperty_388) == 0x000018, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__IntProperty_388' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __NameProperty_389) == 0x00001C, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__NameProperty_389' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __NameProperty_390) == 0x000024, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__NameProperty_390' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __NameProperty_391) == 0x00002C, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__NameProperty_391' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __NameProperty_392) == 0x000034, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__NameProperty_392' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __IntProperty_393) == 0x00003C, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__IntProperty_393' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __NameProperty_394) == 0x000040, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__NameProperty_394' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __IntProperty_395) == 0x000048, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__IntProperty_395' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __NameProperty_396) == 0x00004C, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__NameProperty_396' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __IntProperty_397) == 0x000054, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__IntProperty_397' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __NameProperty_398) == 0x000058, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__NameProperty_398' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __IntProperty_399) == 0x000060, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__IntProperty_399' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __BlendProfile_400) == 0x000068, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__BlendProfile_400' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __CurveFloat_401) == 0x000070, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__CurveFloat_401' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __EnumProperty_402) == 0x000078, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__EnumProperty_402' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __EnumProperty_403) == 0x000079, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__EnumProperty_403' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __ArrayProperty_404) == 0x000080, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__ArrayProperty_404' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __NameProperty_405) == 0x000090, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__NameProperty_405' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __IntProperty_406) == 0x000098, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__IntProperty_406' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __NameProperty_407) == 0x00009C, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__NameProperty_407' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __IntProperty_408) == 0x0000A4, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__IntProperty_408' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __NameProperty_409) == 0x0000A8, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__NameProperty_409' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __IntProperty_410) == 0x0000B0, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__IntProperty_410' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __NameProperty_411) == 0x0000B4, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__NameProperty_411' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __IntProperty_412) == 0x0000BC, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__IntProperty_412' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __NameProperty_413) == 0x0000C0, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__NameProperty_413' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __IntProperty_414) == 0x0000C8, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__IntProperty_414' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __BoolProperty_415) == 0x0000CC, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__BoolProperty_415' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __FloatProperty_416) == 0x0000D0, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__FloatProperty_416' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __StructProperty_417) == 0x0000D4, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__StructProperty_417' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __FloatProperty_418) == 0x000100, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__FloatProperty_418' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __BoolProperty_419) == 0x000104, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__BoolProperty_419' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __EnumProperty_420) == 0x000105, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__EnumProperty_420' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __ByteProperty_421) == 0x000106, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__ByteProperty_421' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __NameProperty_422) == 0x000108, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__NameProperty_422' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __IntProperty_423) == 0x000110, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__IntProperty_423' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __StructProperty_424) == 0x000118, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__StructProperty_424' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __NameProperty_425) == 0x000138, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__NameProperty_425' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, __NameProperty_426) == 0x000140, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::__NameProperty_426' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000148, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001C8, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ABP_FishingRod.ABP_FishingRod_C.AnimBlueprintGeneratedMutableData
// 0x0017 (0x0018 - 0x0001)
struct ABP_FishingRod::FAnimBlueprintGeneratedMutableData final  : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_3DF0[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DF1[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_2;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_3;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_FishingRod::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_FishingRod::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_FishingRod::FAnimBlueprintGeneratedMutableData) == 0x000018, "Wrong size on ABP_FishingRod::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x00000C, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedMutableData, __FloatProperty_2) == 0x000010, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedMutableData::__FloatProperty_2' has a wrong offset!");
static_assert(offsetof(ABP_FishingRod::FAnimBlueprintGeneratedMutableData, __FloatProperty_3) == 0x000014, "Member 'ABP_FishingRod::FAnimBlueprintGeneratedMutableData::__FloatProperty_3' has a wrong offset!");

}

