#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Female_Hair_Medium

#include "Basic.hpp"

#include "F_HairMorphAlphas_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "E_HairMorphOptions_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Female_Hair_Medium.ABP_Female_Hair_Medium_C
// 0x26C0 (0x2A10 - 0x0350)
class UABP_Female_Hair_Medium_C : public UAnimInstance
{
public:
	uint8                                         Pad_4DE8[0x8];                                     // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0360(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0388(0x01D8)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0560(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0580(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x05A0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x0AC0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x0FE0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x1500(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x1A20(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x1F40(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x2460(0x0520)()
	struct FTimerHandle                           TimerHandle;                                       // 0x2980(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        HairMassCAlpha;                                    // 0x2988(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HairMassLAlpha;                                    // 0x2990(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HairMassRAlpha;                                    // 0x2998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HairBangsAlpha;                                    // 0x29A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<E_HairMorphOptions, struct FF_HairMorphAlphas> Alpha_Mapping;                                     // 0x29A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 HairDynamicsEnabledCvar;                           // 0x29F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          HairDynamicsEnabled;                               // 0x2A08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void BlueprintInitializeAnimation();
	void ExecuteUbergraph_ABP_Female_Hair_Medium(int32 EntryPoint, int32 Temp_int_Loop_Counter_Variable, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Add_IntInt_ReturnValue, E_HairMorphOptions Temp_byte_Variable, E_HairMorphOptions Temp_byte_Variable_1, int32 Temp_int_Variable, float Temp_real_Variable, bool Temp_bool_True_if_break_was_hit_Variable, E_HairMorphOptions K2Node_CustomEvent_CurrentMorph, bool CallFunc_Not_PreBool_ReturnValue, class USkeletalMeshComponent* CallFunc_GetOwningComponent_ReturnValue, E_HairMorphOptions Temp_byte_Variable_2, float CallFunc_GetMorphTarget_ReturnValue, float CallFunc_GetMorphTarget_ReturnValue_1, E_HairMorphOptions K2Node_Select_Default, float CallFunc_GetMorphTarget_ReturnValue_2, TArray<float>& K2Node_MakeArray_Array, float CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_EqualEqual_DoubleDouble_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, const struct FF_HairMorphAlphas& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_GetConsoleVariableBoolValue_ReturnValue, class AActor* CallFunc_GetOwningActor_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, class APlayerController* CallFunc_GetPlayerController_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_IsServer_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_2, double CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast);
	void SetAlphas(E_HairMorphOptions CurrentMorph);
	void UpdateMorphTargets();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Female_Hair_Medium_C">();
	}
	static class UABP_Female_Hair_Medium_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Female_Hair_Medium_C>();
	}
};
static_assert(alignof(UABP_Female_Hair_Medium_C) == 0x000010, "Wrong alignment on UABP_Female_Hair_Medium_C");
static_assert(sizeof(UABP_Female_Hair_Medium_C) == 0x002A10, "Wrong size on UABP_Female_Hair_Medium_C");
static_assert(offsetof(UABP_Female_Hair_Medium_C, UberGraphFrame) == 0x000350, "Member 'UABP_Female_Hair_Medium_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UABP_Female_Hair_Medium_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimBlueprintExtension_Base) == 0x000360, "Member 'UABP_Female_Hair_Medium_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_Root) == 0x000368, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_CopyPoseFromMesh) == 0x000388, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_LocalToComponentSpace) == 0x000560, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_ComponentToLocalSpace) == 0x000580, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_AnimDynamics_6) == 0x0005A0, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_AnimDynamics_5) == 0x000AC0, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_AnimDynamics_4) == 0x000FE0, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_AnimDynamics_3) == 0x001500, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_AnimDynamics_2) == 0x001A20, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_AnimDynamics_1) == 0x001F40, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_AnimDynamics) == 0x002460, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, TimerHandle) == 0x002980, "Member 'UABP_Female_Hair_Medium_C::TimerHandle' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, HairMassCAlpha) == 0x002988, "Member 'UABP_Female_Hair_Medium_C::HairMassCAlpha' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, HairMassLAlpha) == 0x002990, "Member 'UABP_Female_Hair_Medium_C::HairMassLAlpha' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, HairMassRAlpha) == 0x002998, "Member 'UABP_Female_Hair_Medium_C::HairMassRAlpha' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, HairBangsAlpha) == 0x0029A0, "Member 'UABP_Female_Hair_Medium_C::HairBangsAlpha' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, Alpha_Mapping) == 0x0029A8, "Member 'UABP_Female_Hair_Medium_C::Alpha_Mapping' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, HairDynamicsEnabledCvar) == 0x0029F8, "Member 'UABP_Female_Hair_Medium_C::HairDynamicsEnabledCvar' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, HairDynamicsEnabled) == 0x002A08, "Member 'UABP_Female_Hair_Medium_C::HairDynamicsEnabled' has a wrong offset!");

}

