#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PC_Female

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "Palia_classes.hpp"
#include "ABP_PC_Female_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PC_Female.ABP_PC_Female_C
// 0x6240 (0x6D50 - 0x0B10)
class UABP_PC_Female_C final  : public UVAL_ValeriaPCAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_PC_Female::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0B18(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0B28(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0B30(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0B38(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0B58(0x00C8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x0C20(0x0128)()
	uint8                                         Pad_27A2[0x8];                                     // 0x0D48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_3;                         // 0x0D50(0x0270)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_2;                         // 0x0FC0(0x0270)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x1230(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x1250(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x1378(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x14A0(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x15C8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x15E8(0x0128)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x1710(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x1758(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x1860(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x1888(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x18B0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_66;                 // 0x18D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_65;                 // 0x18F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64;                 // 0x1920(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_63;                 // 0x1948(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_62;                 // 0x1970(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_61;                 // 0x1998(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_60;                 // 0x19C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59;                 // 0x19E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_58;                 // 0x1A10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_57;                 // 0x1A38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_56;                 // 0x1A60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_55;                 // 0x1A88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54;                 // 0x1AB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_53;                 // 0x1AD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_52;                 // 0x1B00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_51;                 // 0x1B28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50;                 // 0x1B50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49;                 // 0x1B78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48;                 // 0x1BA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47;                 // 0x1BC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0x1BF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0x1C18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x1C40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0x1C68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x1C90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x1CB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x1CE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x1D08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x1D30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x1D58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x1D80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x1DA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x1DD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x1DF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x1E20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x1E48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x1E70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x1E98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x1EC0(0x0028)()
	struct FAnimNode_PlayBlendSpaceByMapping      AnimGraphNode_PlayBlendSpaceByMapping_8;           // 0x1EE8(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_31;                      // 0x1FA0(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_17;            // 0x1FC0(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_30;                      // 0x2080(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_16;            // 0x20A0(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_29;                      // 0x2160(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_15;            // 0x2180(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_28;                      // 0x2240(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_14;            // 0x2260(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_27;                      // 0x2320(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_13;            // 0x2340(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_26;                      // 0x2400(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_12;            // 0x2420(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_25;                      // 0x24E0(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_2;                       // 0x2500(0x0100)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_11;            // 0x2600(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_24;                      // 0x26C0(0x0020)()
	struct FAnimNode_PlayBlendSpaceByMapping      AnimGraphNode_PlayBlendSpaceByMapping_7;           // 0x26E0(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_23;                      // 0x2798(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_10;            // 0x27B8(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0x2878(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_1;                       // 0x2898(0x0100)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_9;             // 0x2998(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21;                      // 0x2A58(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_8;             // 0x2A78(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20;                      // 0x2B38(0x0020)()
	struct FAnimNode_PlayBlendSpaceByMapping      AnimGraphNode_PlayBlendSpaceByMapping_6;           // 0x2B58(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_19;                      // 0x2C10(0x0020)()
	struct FAnimNode_PlayBlendSpaceByMapping      AnimGraphNode_PlayBlendSpaceByMapping_5;           // 0x2C30(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_18;                      // 0x2CE8(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x2D08(0x0100)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x2E08(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0x2E50(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x2F18(0x0048)()
	struct FAnimNode_PlayBlendSpaceByMapping      AnimGraphNode_PlayBlendSpaceByMapping_4;           // 0x2F60(0x00B8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x3018(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x3060(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x3128(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x3170(0x00C8)()
	struct FAnimNode_PlayBlendSpaceByMapping      AnimGraphNode_PlayBlendSpaceByMapping_3;           // 0x3238(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0x32F0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0x3310(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x33D8(0x0108)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x34E0(0x0108)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x35E8(0x0048)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x3630(0x0100)()
	struct FAnimNode_LookAtBlendSpaceByMapping    AnimGraphNode_LookAtBlendSpaceByMapping;           // 0x3730(0x0140)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x3870(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x38B8(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x3998(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x39C0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x3A08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x3A30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x3A58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x3A80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x3AA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x3AD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x3AF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x3B20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x3B48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x3B70(0x0028)()
	struct FAnimNode_EvalSequenceByMapping        AnimGraphNode_EvalSequenceByMapping_2;             // 0x3B98(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x3C28(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x3C48(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x3C70(0x0020)()
	struct FAnimNode_PlayBlendSpaceByMapping      AnimGraphNode_PlayBlendSpaceByMapping_2;           // 0x3C90(0x00B8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x3D48(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_7;             // 0x3D68(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x3E28(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x3E48(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x3E70(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x3EB8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x3F00(0x00E0)()
	struct FAnimNode_EvalSequenceByMapping        AnimGraphNode_EvalSequenceByMapping_1;             // 0x3FE0(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x4070(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x4090(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x40B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x40E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x4108(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x4130(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x4158(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x4180(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x41A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x41D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x41F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x4220(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x4248(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x4270(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x4298(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x42C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x42E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x4310(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x4338(0x0028)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_6;             // 0x4360(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x4420(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_5;             // 0x4440(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x4500(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_4;             // 0x4520(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x45E0(0x0020)()
	struct FAnimNode_RandomSequenceByMapping      AnimGraphNode_RandomSequenceByMapping;             // 0x4600(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x4690(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x46B0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x4778(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_3;             // 0x4798(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x4858(0x0020)()
	struct FAnimNode_PlayBlendSpaceByMapping      AnimGraphNode_PlayBlendSpaceByMapping_1;           // 0x4878(0x00B8)()
	struct FAnimNode_PlayBlendSpaceByMapping      AnimGraphNode_PlayBlendSpaceByMapping;             // 0x4930(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x49E8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x4A30(0x0020)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_2;             // 0x4A50(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x4B10(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x4B30(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x4B58(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x4BA0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x4BE8(0x00E0)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping_1;             // 0x4CC8(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x4D88(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x4DA8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x4DD0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x4E18(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x4E60(0x00E0)()
	struct FAnimNode_EvalSequenceByMapping        AnimGraphNode_EvalSequenceByMapping;               // 0x4F40(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x4FD0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x4FF0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x5018(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x5060(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x50A8(0x00E0)()
	struct FAnimNode_PlaySequenceByMapping        AnimGraphNode_PlaySequenceByMapping;               // 0x5188(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x5248(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x5268(0x0028)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x5290(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x5358(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x5378(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x5440(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x5548(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x5570(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x5598(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x5660(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x56A8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x56C8(0x0020)()
	uint8                                         Pad_27A3[0x8];                                     // 0x56E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_1;                            // 0x56F0(0x01F0)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik;                              // 0x58E0(0x01F0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x5AD0(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x5B98(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x5C60(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x5CA8(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x5CF0(0x00C8)()
	uint8                                         Pad_27A4[0x8];                                     // 0x5DB8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x5DC0(0x0270)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x6030(0x0270)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x62A0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x63C8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x64F0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x6618(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x6740(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x6868(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x6990(0x0128)()
	class FString                                 CVar_ClimbingIKEnable;                             // 0x6AB8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FVector                                HandSocketLocation_Left;                           // 0x6AC8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HandSocketLocation_Right;                          // 0x6AE0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IKHandEffector_Left;                               // 0x6AF8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IKHandEffector_Right;                              // 0x6B10(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHandHittingWall_Left;                            // 0x6B28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHandHittingWall_Right;                           // 0x6B29(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27A5[0x2];                                     // 0x6B2A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IKHandHitLocationMultiplier;                       // 0x6B2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        LeftHandIKAlpha;                                   // 0x6B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RightHandIKAlpha;                                  // 0x6B38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LeftHandIKLock;                                    // 0x6B40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RightHandIKLock;                                   // 0x6B41(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27A6[0x6];                                     // 0x6B42(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Lock_Interp_Speed;                                 // 0x6B48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Unlock_Interp_Speed;                               // 0x6B50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LeanRotator;                                       // 0x6B58(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FBoxSphereBounds                       LeftHandSphere;                                    // 0x6B70(0x0038)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FBoxSphereBounds                       RightHandSphere;                                   // 0x6BA8(0x0038)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsLeftHandHigher;                                  // 0x6BE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsIkEnabledThreaded;                               // 0x6BE1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27A7[0x6];                                     // 0x6BE2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               RightHandRot;                                      // 0x6BE8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               LeftHandRot;                                       // 0x6C00(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Trace_Out_Normal_Left;                             // 0x6C18(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Trace_Out_Normal_Right;                            // 0x6C30(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTime;                                         // 0x6C48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27A8[0x4];                                     // 0x6C4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Foot_IK_L_Offset;                                  // 0x6C50(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Foot_IK_R_Offset;                                  // 0x6C68(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Foot_IK_L_Rotation_Offset;                         // 0x6C80(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Foot_IK_R_Rotation_Offset;                         // 0x6C98(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                Foot_IK_Pelvis_Offset;                             // 0x6CB0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Foot_IK_Pelvis_Offset_Alpha;                       // 0x6CC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27A9[0x4];                                     // 0x6CCC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Foot_Ik_R_Target;                                  // 0x6CD0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Foot_Ik_L_Target;                                  // 0x6CE8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootIKStartTraceDistance;                          // 0x6D00(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FootIKEndTraceDistance;                            // 0x6D18(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IKFootHeight;                                      // 0x6D30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CVar_FootIKEnable;                                 // 0x6D38(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          FootIKEnabled;                                     // 0x6D48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void AnimNotify_AbilityLockIn();
	void AnimNotify_EnterCatchOnWall();
	void AnimNotify_EnterFallLoop();
	void AnimNotify_EnterJumpLand();
	void AnimNotify_EnterJumpLoop();
	void AnimNotify_EnterJumpPedal();
	void AnimNotify_EnterJumpStart();
	void AnimNotify_FishingDone();
	void AnimNotify_Hide_Fish();
	void AnimNotify_InspirationEnd();
	void AnimNotify_LeftHandClimb();
	void AnimNotify_LeftHandClimbingIK();
	void AnimNotify_LeftHandIKLock();
	void AnimNotify_LeftHandIKUnLock();
	void AnimNotify_NotifyShowArrow();
	void AnimNotify_RightHandClimb();
	void AnimNotify_RightHandClimbingIK();
	void AnimNotify_RightHandIKLock();
	void AnimNotify_RightHandIKUnLock();
