#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Female_Hair_Medium

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "E_HairMorphOptions_structs.hpp"
#include "F_HairMorphAlphas_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Female_Hair_Medium.ABP_Female_Hair_Medium_C
// 0x2650 (0x29A0 - 0x0350)
class UABP_Female_Hair_Medium_C : public UAnimInstance
{
public:
	uint8                                         Pad_5EB1[0x8];                                     // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0360(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0368(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0388(0x0158)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x04E0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0500(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x0520(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x0A40(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x0F60(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x1480(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x19A0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x1EC0(0x0520)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x23E0(0x0520)()
	struct FTimerHandle                           TimerHandle;                                       // 0x2900(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        HairMassCAlpha;                                    // 0x2908(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HairMassLAlpha;                                    // 0x2910(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HairMassRAlpha;                                    // 0x2918(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HairBangsAlpha;                                    // 0x2920(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<E_HairMorphOptions, struct FF_HairMorphAlphas> Alpha_Mapping;                                     // 0x2928(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 HairDynamicsEnabledCvar;                           // 0x2978(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          HairDynamicsEnabled;                               // 0x2988(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EB2[0x7];                                     // 0x2989(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      WardrobeDoll;                                      // 0x2990(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void BlueprintInitializeAnimation();
	void ExecuteUbergraph_ABP_Female_Hair_Medium(int32 EntryPoint, int32 Temp_int_Loop_Counter_Variable, int32 Temp_int_Variable, int32 CallFunc_Add_IntInt_ReturnValue, float Temp_real_Variable, E_HairMorphOptions Temp_byte_Variable, E_HairMorphOptions K2Node_CustomEvent_CurrentMorph, E_HairMorphOptions Temp_byte_Variable_1, class USkeletalMeshComponent* CallFunc_GetOwningComponent_ReturnValue, float CallFunc_GetMorphTarget_ReturnValue, float CallFunc_GetMorphTarget_ReturnValue_1, float CallFunc_GetMorphTarget_ReturnValue_2, TArray<float>& K2Node_MakeArray_Array, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, const struct FF_HairMorphAlphas& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_GetConsoleVariableBoolValue_ReturnValue, class AActor* CallFunc_GetOwningActor_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, class APlayerController* CallFunc_GetPlayerController_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_IsServer_ReturnValue, int32 Temp_int_Array_Index_Variable, bool CallFunc_Not_PreBool_ReturnValue, float CallFunc_Array_Get_Item, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_EqualEqual_DoubleDouble_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, bool Temp_bool_True_if_break_was_hit_Variable, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_2, E_HairMorphOptions Temp_byte_Variable_2, E_HairMorphOptions K2Node_Select_Default, double CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast);
	void SetAlphas(E_HairMorphOptions CurrentMorph);
	void UpdateMorphTargets();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Female_Hair_Medium_C">();
	}
	static class UABP_Female_Hair_Medium_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Female_Hair_Medium_C>();
	}
};
static_assert(alignof(UABP_Female_Hair_Medium_C) == 0x000010, "Wrong alignment on UABP_Female_Hair_Medium_C");
static_assert(sizeof(UABP_Female_Hair_Medium_C) == 0x0029A0, "Wrong size on UABP_Female_Hair_Medium_C");
static_assert(offsetof(UABP_Female_Hair_Medium_C, UberGraphFrame) == 0x000350, "Member 'UABP_Female_Hair_Medium_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimBlueprintExtension_PropertyAccess) == 0x000358, "Member 'UABP_Female_Hair_Medium_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimBlueprintExtension_Base) == 0x000360, "Member 'UABP_Female_Hair_Medium_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_Root) == 0x000368, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_CopyPoseFromMesh) == 0x000388, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_LocalToComponentSpace) == 0x0004E0, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_ComponentToLocalSpace) == 0x000500, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_AnimDynamics_6) == 0x000520, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_AnimDynamics_5) == 0x000A40, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_AnimDynamics_4) == 0x000F60, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_AnimDynamics_3) == 0x001480, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_AnimDynamics_2) == 0x0019A0, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_AnimDynamics_1) == 0x001EC0, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, AnimGraphNode_AnimDynamics) == 0x0023E0, "Member 'UABP_Female_Hair_Medium_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, TimerHandle) == 0x002900, "Member 'UABP_Female_Hair_Medium_C::TimerHandle' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, HairMassCAlpha) == 0x002908, "Member 'UABP_Female_Hair_Medium_C::HairMassCAlpha' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, HairMassLAlpha) == 0x002910, "Member 'UABP_Female_Hair_Medium_C::HairMassLAlpha' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, HairMassRAlpha) == 0x002918, "Member 'UABP_Female_Hair_Medium_C::HairMassRAlpha' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, HairBangsAlpha) == 0x002920, "Member 'UABP_Female_Hair_Medium_C::HairBangsAlpha' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, Alpha_Mapping) == 0x002928, "Member 'UABP_Female_Hair_Medium_C::Alpha_Mapping' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, HairDynamicsEnabledCvar) == 0x002978, "Member 'UABP_Female_Hair_Medium_C::HairDynamicsEnabledCvar' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, HairDynamicsEnabled) == 0x002988, "Member 'UABP_Female_Hair_Medium_C::HairDynamicsEnabled' has a wrong offset!");
static_assert(offsetof(UABP_Female_Hair_Medium_C, WardrobeDoll) == 0x002990, "Member 'UABP_Female_Hair_Medium_C::WardrobeDoll' has a wrong offset!");

}

