#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Female_Hair_Medium

#include "Basic.hpp"

#include "F_HairMorphAlphas_structs.hpp"
#include "Engine_structs.hpp"
#include "E_HairMorphOptions_structs.hpp"


namespace SDK::Params
{

// Function ABP_Female_Hair_Medium.ABP_Female_Hair_Medium_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Female_Hair_Medium_C_AnimGraph final 
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Female_Hair_Medium_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Female_Hair_Medium_C_AnimGraph");
static_assert(sizeof(ABP_Female_Hair_Medium_C_AnimGraph) == 0x000010, "Wrong size on ABP_Female_Hair_Medium_C_AnimGraph");
static_assert(offsetof(ABP_Female_Hair_Medium_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_Female_Hair_Medium_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABP_Female_Hair_Medium.ABP_Female_Hair_Medium_C.ExecuteUbergraph_ABP_Female_Hair_Medium
// 0x00E0 (0x00E0 - 0x0000)
struct ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium final 
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_HairMorphOptions                            Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_HairMorphOptions                            Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DE9[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_HairMorphOptions                            K2Node_CustomEvent_CurrentMorph;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DEA[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponent_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	E_HairMorphOptions                            Temp_byte_Variable_2;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DEB[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMorphTarget_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMorphTarget_ReturnValue_1;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_HairMorphOptions                            K2Node_Select_Default;                             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DEC[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMorphTarget_ReturnValue_2;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DED[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_Array_Get_Item;                           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DEE[0x4];                                     // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_HairMorphAlphas                     CallFunc_Map_Find_Value;                           // 0x0060(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DEF[0x6];                                     // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00B0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DF0[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium) == 0x000008, "Wrong alignment on ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium");
static_assert(sizeof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium) == 0x0000E0, "Wrong size on ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, EntryPoint) == 0x000000, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, Temp_int_Array_Index_Variable) == 0x000008, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, Temp_byte_Variable) == 0x000010, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, Temp_byte_Variable_1) == 0x000011, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, Temp_int_Variable) == 0x000014, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, Temp_real_Variable) == 0x000018, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, Temp_bool_True_if_break_was_hit_Variable) == 0x00001C, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, K2Node_CustomEvent_CurrentMorph) == 0x00001D, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::K2Node_CustomEvent_CurrentMorph' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_Not_PreBool_ReturnValue) == 0x00001E, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_GetOwningComponent_ReturnValue) == 0x000020, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_GetOwningComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, Temp_byte_Variable_2) == 0x000028, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_GetMorphTarget_ReturnValue) == 0x00002C, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_GetMorphTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_GetMorphTarget_ReturnValue_1) == 0x000030, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_GetMorphTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, K2Node_Select_Default) == 0x000034, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_GetMorphTarget_ReturnValue_2) == 0x000038, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_GetMorphTarget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, K2Node_MakeArray_Array) == 0x000040, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_Array_Get_Item) == 0x000050, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000058, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_Less_IntInt_ReturnValue) == 0x000059, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_BooleanAND_ReturnValue) == 0x00005A, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_Array_Contains_ReturnValue) == 0x00005B, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_Map_Find_Value) == 0x000060, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_Map_Find_ReturnValue) == 0x000098, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000099, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_GetOwningActor_ReturnValue) == 0x0000A0, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_GetOwner_ReturnValue) == 0x0000A8, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, K2Node_CreateDelegate_OutputDelegate) == 0x0000B0, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_GetPlayerController_ReturnValue) == 0x0000C0, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000C8, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000D0, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_IsServer_ReturnValue) == 0x0000D1, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000D2, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_BooleanAND_ReturnValue_1) == 0x0000D3, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_BooleanAND_ReturnValue_2) == 0x0000D4, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x0000D8, "Member 'ABP_Female_Hair_Medium_C_ExecuteUbergraph_ABP_Female_Hair_Medium::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function ABP_Female_Hair_Medium.ABP_Female_Hair_Medium_C.SetAlphas
// 0x0001 (0x0001 - 0x0000)
struct ABP_Female_Hair_Medium_C_SetAlphas final 
{
public:
	E_HairMorphOptions                            CurrentMorph;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Female_Hair_Medium_C_SetAlphas) == 0x000001, "Wrong alignment on ABP_Female_Hair_Medium_C_SetAlphas");
static_assert(sizeof(ABP_Female_Hair_Medium_C_SetAlphas) == 0x000001, "Wrong size on ABP_Female_Hair_Medium_C_SetAlphas");
static_assert(offsetof(ABP_Female_Hair_Medium_C_SetAlphas, CurrentMorph) == 0x000000, "Member 'ABP_Female_Hair_Medium_C_SetAlphas::CurrentMorph' has a wrong offset!");

}

