#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterSelection_Windmill_Blade

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CharacterSelection_Windmill_Blade.BP_CharacterSelection_Windmill_Blade_C.BndEvt__BP_CharacterSelection_Windmill_RotatingMovement_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_CharacterSelection_Windmill_Blade_C_BndEvt__BP_CharacterSelection_Windmill_RotatingMovement_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature final 
{
public:
	class UActorComponent*                        Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSelection_Windmill_Blade_C_BndEvt__BP_CharacterSelection_Windmill_RotatingMovement_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_CharacterSelection_Windmill_Blade_C_BndEvt__BP_CharacterSelection_Windmill_RotatingMovement_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature");
static_assert(sizeof(BP_CharacterSelection_Windmill_Blade_C_BndEvt__BP_CharacterSelection_Windmill_RotatingMovement_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature) == 0x000010, "Wrong size on BP_CharacterSelection_Windmill_Blade_C_BndEvt__BP_CharacterSelection_Windmill_RotatingMovement_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature");
static_assert(offsetof(BP_CharacterSelection_Windmill_Blade_C_BndEvt__BP_CharacterSelection_Windmill_RotatingMovement_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature, Component) == 0x000000, "Member 'BP_CharacterSelection_Windmill_Blade_C_BndEvt__BP_CharacterSelection_Windmill_RotatingMovement_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature::Component' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelection_Windmill_Blade_C_BndEvt__BP_CharacterSelection_Windmill_RotatingMovement_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature, bReset) == 0x000008, "Member 'BP_CharacterSelection_Windmill_Blade_C_BndEvt__BP_CharacterSelection_Windmill_RotatingMovement_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature::bReset' has a wrong offset!");

// Function BP_CharacterSelection_Windmill_Blade.BP_CharacterSelection_Windmill_Blade_C.ExecuteUbergraph_BP_CharacterSelection_Windmill_Blade
// 0x0018 (0x0018 - 0x0000)
struct BP_CharacterSelection_Windmill_Blade_C_ExecuteUbergraph_BP_CharacterSelection_Windmill_Blade final 
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EC9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        K2Node_ComponentBoundEvent_Component;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bReset;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CharacterSelection_Windmill_Blade_C_ExecuteUbergraph_BP_CharacterSelection_Windmill_Blade) == 0x000008, "Wrong alignment on BP_CharacterSelection_Windmill_Blade_C_ExecuteUbergraph_BP_CharacterSelection_Windmill_Blade");
static_assert(sizeof(BP_CharacterSelection_Windmill_Blade_C_ExecuteUbergraph_BP_CharacterSelection_Windmill_Blade) == 0x000018, "Wrong size on BP_CharacterSelection_Windmill_Blade_C_ExecuteUbergraph_BP_CharacterSelection_Windmill_Blade");
static_assert(offsetof(BP_CharacterSelection_Windmill_Blade_C_ExecuteUbergraph_BP_CharacterSelection_Windmill_Blade, EntryPoint) == 0x000000, "Member 'BP_CharacterSelection_Windmill_Blade_C_ExecuteUbergraph_BP_CharacterSelection_Windmill_Blade::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelection_Windmill_Blade_C_ExecuteUbergraph_BP_CharacterSelection_Windmill_Blade, K2Node_ComponentBoundEvent_Component) == 0x000008, "Member 'BP_CharacterSelection_Windmill_Blade_C_ExecuteUbergraph_BP_CharacterSelection_Windmill_Blade::K2Node_ComponentBoundEvent_Component' has a wrong offset!");
static_assert(offsetof(BP_CharacterSelection_Windmill_Blade_C_ExecuteUbergraph_BP_CharacterSelection_Windmill_Blade, K2Node_ComponentBoundEvent_bReset) == 0x000010, "Member 'BP_CharacterSelection_Windmill_Blade_C_ExecuteUbergraph_BP_CharacterSelection_Windmill_Blade::K2Node_ComponentBoundEvent_bReset' has a wrong offset!");

}

