#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ValeriaPlayerController

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "CommonInput_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "S6Core_structs.hpp"
#include "ETutorialVolumeType_structs.hpp"
#include "S6EnhancedInputExtended_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "PerfLocationTable_structs.hpp"
#include "FPerfLocCaptureProfile_structs.hpp"
#include "InputCore_structs.hpp"
#include "OnlineSubsystemValeria_structs.hpp"


namespace SDK::Params
{

// Function BP_ValeriaPlayerController.BP_ValeriaPlayerController_C.AccumulateLookModeInputGamepad
// 0x0030 (0x0030 - 0x0000)
struct BP_ValeriaPlayerController_C_AccumulateLookModeInputGamepad final 
{
public:
	double                                        InputY;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ResultY;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVAL_PlayerCameraManager*               K2Node_DynamicCast_AsVAL_Player_Camera_Manager;    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaPlayerController_C_AccumulateLookModeInputGamepad) == 0x000008, "Wrong alignment on BP_ValeriaPlayerController_C_AccumulateLookModeInputGamepad");
static_assert(sizeof(BP_ValeriaPlayerController_C_AccumulateLookModeInputGamepad) == 0x000030, "Wrong size on BP_ValeriaPlayerController_C_AccumulateLookModeInputGamepad");
static_assert(offsetof(BP_ValeriaPlayerController_C_AccumulateLookModeInputGamepad, InputY) == 0x000000, "Member 'BP_ValeriaPlayerController_C_AccumulateLookModeInputGamepad::InputY' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_AccumulateLookModeInputGamepad, ResultY) == 0x000008, "Member 'BP_ValeriaPlayerController_C_AccumulateLookModeInputGamepad::ResultY' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_AccumulateLookModeInputGamepad, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_ValeriaPlayerController_C_AccumulateLookModeInputGamepad::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_AccumulateLookModeInputGamepad, Temp_real_Variable) == 0x000018, "Member 'BP_ValeriaPlayerController_C_AccumulateLookModeInputGamepad::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_AccumulateLookModeInputGamepad, K2Node_DynamicCast_AsVAL_Player_Camera_Manager) == 0x000020, "Member 'BP_ValeriaPlayerController_C_AccumulateLookModeInputGamepad::K2Node_DynamicCast_AsVAL_Player_Camera_Manager' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_AccumulateLookModeInputGamepad, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_ValeriaPlayerController_C_AccumulateLookModeInputGamepad::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_AccumulateLookModeInputGamepad, CallFunc_BooleanAND_ReturnValue) == 0x000029, "Member 'BP_ValeriaPlayerController_C_AccumulateLookModeInputGamepad::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_ValeriaPlayerController.BP_ValeriaPlayerController_C.AudioFade
// 0x0008 (0x0008 - 0x0000)
struct BP_ValeriaPlayerController_C_AudioFade final 
{
public:
	bool                                          bFadeOut;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC0[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeTime;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaPlayerController_C_AudioFade) == 0x000004, "Wrong alignment on BP_ValeriaPlayerController_C_AudioFade");
static_assert(sizeof(BP_ValeriaPlayerController_C_AudioFade) == 0x000008, "Wrong size on BP_ValeriaPlayerController_C_AudioFade");
static_assert(offsetof(BP_ValeriaPlayerController_C_AudioFade, bFadeOut) == 0x000000, "Member 'BP_ValeriaPlayerController_C_AudioFade::bFadeOut' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_AudioFade, FadeTime) == 0x000004, "Member 'BP_ValeriaPlayerController_C_AudioFade::FadeTime' has a wrong offset!");

// Function BP_ValeriaPlayerController.BP_ValeriaPlayerController_C.CameraAssistLookUpAtRate
// 0x0038 (0x0038 - 0x0000)
struct BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate final 
{
public:
	double                                        ActionValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      Param_ValeriaCharacter;                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Need_Camera_Assist_Look_Up_IsNeed;     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC1[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Is_Need_Camera_Assist_Look_Up_ReCameraForwardVectorZ; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNeedCameraAssistTurn_IsNeed;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC2[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC3[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_LookUpAtRate_Rate_ImplicitCast;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate) == 0x000008, "Wrong alignment on BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate");
static_assert(sizeof(BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate) == 0x000038, "Wrong size on BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate");
static_assert(offsetof(BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate, ActionValue) == 0x000000, "Member 'BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate::ActionValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate, Param_ValeriaCharacter) == 0x000008, "Member 'BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate::Param_ValeriaCharacter' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate, CallFunc_Is_Need_Camera_Assist_Look_Up_IsNeed) == 0x000010, "Member 'BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate::CallFunc_Is_Need_Camera_Assist_Look_Up_IsNeed' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate, CallFunc_Is_Need_Camera_Assist_Look_Up_ReCameraForwardVectorZ) == 0x000018, "Member 'BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate::CallFunc_Is_Need_Camera_Assist_Look_Up_ReCameraForwardVectorZ' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate, CallFunc_IsNeedCameraAssistTurn_IsNeed) == 0x000020, "Member 'BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate::CallFunc_IsNeedCameraAssistTurn_IsNeed' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate, CallFunc_BooleanAND_ReturnValue) == 0x000030, "Member 'BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate, CallFunc_LookUpAtRate_Rate_ImplicitCast) == 0x000034, "Member 'BP_ValeriaPlayerController_C_CameraAssistLookUpAtRate::CallFunc_LookUpAtRate_Rate_ImplicitCast' has a wrong offset!");

// Function BP_ValeriaPlayerController.BP_ValeriaPlayerController_C.CameraAssistTurnAtRate
// 0x0028 (0x0028 - 0x0000)
struct BP_ValeriaPlayerController_C_CameraAssistTurnAtRate final 
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      Param_ValeriaCharacter;                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNeedCameraAssistTurn_IsNeed;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC4[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_TurnAtRate_Rate_ImplicitCast;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaPlayerController_C_CameraAssistTurnAtRate) == 0x000008, "Wrong alignment on BP_ValeriaPlayerController_C_CameraAssistTurnAtRate");
static_assert(sizeof(BP_ValeriaPlayerController_C_CameraAssistTurnAtRate) == 0x000028, "Wrong size on BP_ValeriaPlayerController_C_CameraAssistTurnAtRate");
static_assert(offsetof(BP_ValeriaPlayerController_C_CameraAssistTurnAtRate, Value) == 0x000000, "Member 'BP_ValeriaPlayerController_C_CameraAssistTurnAtRate::Value' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CameraAssistTurnAtRate, Param_ValeriaCharacter) == 0x000008, "Member 'BP_ValeriaPlayerController_C_CameraAssistTurnAtRate::Param_ValeriaCharacter' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CameraAssistTurnAtRate, CallFunc_IsNeedCameraAssistTurn_IsNeed) == 0x000010, "Member 'BP_ValeriaPlayerController_C_CameraAssistTurnAtRate::CallFunc_IsNeedCameraAssistTurn_IsNeed' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CameraAssistTurnAtRate, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_ValeriaPlayerController_C_CameraAssistTurnAtRate::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CameraAssistTurnAtRate, CallFunc_TurnAtRate_Rate_ImplicitCast) == 0x000020, "Member 'BP_ValeriaPlayerController_C_CameraAssistTurnAtRate::CallFunc_TurnAtRate_Rate_ImplicitCast' has a wrong offset!");

// Function BP_ValeriaPlayerController.BP_ValeriaPlayerController_C.CanOpenMenus
// 0x0018 (0x0018 - 0x0000)
struct BP_ValeriaPlayerController_C_CanOpenMenus final 
{
public:
	bool                                          InDialogue;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC5[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanOpenMenus_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaPlayerController_C_CanOpenMenus) == 0x000008, "Wrong alignment on BP_ValeriaPlayerController_C_CanOpenMenus");
static_assert(sizeof(BP_ValeriaPlayerController_C_CanOpenMenus) == 0x000018, "Wrong size on BP_ValeriaPlayerController_C_CanOpenMenus");
static_assert(offsetof(BP_ValeriaPlayerController_C_CanOpenMenus, InDialogue) == 0x000000, "Member 'BP_ValeriaPlayerController_C_CanOpenMenus::InDialogue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CanOpenMenus, CallFunc_GetValeriaCharacter_OutResult) == 0x000001, "Member 'BP_ValeriaPlayerController_C_CanOpenMenus::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CanOpenMenus, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'BP_ValeriaPlayerController_C_CanOpenMenus::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CanOpenMenus, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'BP_ValeriaPlayerController_C_CanOpenMenus::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CanOpenMenus, CallFunc_CanOpenMenus_ReturnValue) == 0x000011, "Member 'BP_ValeriaPlayerController_C_CanOpenMenus::CallFunc_CanOpenMenus_ReturnValue' has a wrong offset!");

// Function BP_ValeriaPlayerController.BP_ValeriaPlayerController_C.CanUpdateIMCByInputType
// 0x0004 (0x0004 - 0x0000)
struct BP_ValeriaPlayerController_C_CanUpdateIMCByInputType final 
{
public:
	ECommonInputType                              NewInputType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanUpdate;                                         // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSwitchPlatform_ReturnValue;             // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaPlayerController_C_CanUpdateIMCByInputType) == 0x000001, "Wrong alignment on BP_ValeriaPlayerController_C_CanUpdateIMCByInputType");
static_assert(sizeof(BP_ValeriaPlayerController_C_CanUpdateIMCByInputType) == 0x000004, "Wrong size on BP_ValeriaPlayerController_C_CanUpdateIMCByInputType");
static_assert(offsetof(BP_ValeriaPlayerController_C_CanUpdateIMCByInputType, NewInputType) == 0x000000, "Member 'BP_ValeriaPlayerController_C_CanUpdateIMCByInputType::NewInputType' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CanUpdateIMCByInputType, CanUpdate) == 0x000001, "Member 'BP_ValeriaPlayerController_C_CanUpdateIMCByInputType::CanUpdate' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CanUpdateIMCByInputType, CallFunc_IsSwitchPlatform_ReturnValue) == 0x000002, "Member 'BP_ValeriaPlayerController_C_CanUpdateIMCByInputType::CallFunc_IsSwitchPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CanUpdateIMCByInputType, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000003, "Member 'BP_ValeriaPlayerController_C_CanUpdateIMCByInputType::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_ValeriaPlayerController.BP_ValeriaPlayerController_C.ChangePlayerState
// 0x01D8 (0x01D8 - 0x0000)
struct BP_ValeriaPlayerController_C_ChangePlayerState final 
{
public:
	ECharacterState                               NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC6[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCharacterStateChangeParams            ChangeParams;                                      // 0x0008(0x01A8)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC7[0x7];                                     // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC8[0x7];                                     // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterStateMachineComponent*        CallFunc_GetCSM_ReturnValue;                       // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ChangeState_ReturnValue;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaPlayerController_C_ChangePlayerState) == 0x000008, "Wrong alignment on BP_ValeriaPlayerController_C_ChangePlayerState");
static_assert(sizeof(BP_ValeriaPlayerController_C_ChangePlayerState) == 0x0001D8, "Wrong size on BP_ValeriaPlayerController_C_ChangePlayerState");
static_assert(offsetof(BP_ValeriaPlayerController_C_ChangePlayerState, NewState) == 0x000000, "Member 'BP_ValeriaPlayerController_C_ChangePlayerState::NewState' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_ChangePlayerState, ChangeParams) == 0x000008, "Member 'BP_ValeriaPlayerController_C_ChangePlayerState::ChangeParams' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_ChangePlayerState, CallFunc_GetValeriaCharacter_OutResult) == 0x0001B0, "Member 'BP_ValeriaPlayerController_C_ChangePlayerState::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_ChangePlayerState, CallFunc_GetValeriaCharacter_ReturnValue) == 0x0001B8, "Member 'BP_ValeriaPlayerController_C_ChangePlayerState::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_ChangePlayerState, K2Node_SwitchEnum_CmpSuccess) == 0x0001C0, "Member 'BP_ValeriaPlayerController_C_ChangePlayerState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_ChangePlayerState, CallFunc_GetCSM_ReturnValue) == 0x0001C8, "Member 'BP_ValeriaPlayerController_C_ChangePlayerState::CallFunc_GetCSM_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_ChangePlayerState, CallFunc_ChangeState_ReturnValue) == 0x0001D0, "Member 'BP_ValeriaPlayerController_C_ChangePlayerState::CallFunc_ChangeState_ReturnValue' has a wrong offset!");

// Function BP_ValeriaPlayerController.BP_ValeriaPlayerController_C.CharacterStateIs
// 0x0048 (0x0048 - 0x0000)
struct BP_ValeriaPlayerController_C_CharacterStateIs final 
{
public:
	TArray<ECharacterState>                       StatesToCheck;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Contains;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterState                               State;                                             // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterState                               NewLocalVar_0;                                     // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC9[0x1];                                     // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterState                               CallFunc_Array_Get_Item;                           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ECA[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ECB[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterStateMachineComponent*        CallFunc_GetCSM_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECharacterState                               CallFunc_GetCurrentStateType_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaPlayerController_C_CharacterStateIs) == 0x000008, "Wrong alignment on BP_ValeriaPlayerController_C_CharacterStateIs");
static_assert(sizeof(BP_ValeriaPlayerController_C_CharacterStateIs) == 0x000048, "Wrong size on BP_ValeriaPlayerController_C_CharacterStateIs");
static_assert(offsetof(BP_ValeriaPlayerController_C_CharacterStateIs, StatesToCheck) == 0x000000, "Member 'BP_ValeriaPlayerController_C_CharacterStateIs::StatesToCheck' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CharacterStateIs, Contains) == 0x000010, "Member 'BP_ValeriaPlayerController_C_CharacterStateIs::Contains' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CharacterStateIs, State) == 0x000011, "Member 'BP_ValeriaPlayerController_C_CharacterStateIs::State' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CharacterStateIs, NewLocalVar_0) == 0x000012, "Member 'BP_ValeriaPlayerController_C_CharacterStateIs::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CharacterStateIs, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_ValeriaPlayerController_C_CharacterStateIs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CharacterStateIs, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_ValeriaPlayerController_C_CharacterStateIs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CharacterStateIs, CallFunc_Array_Get_Item) == 0x00001C, "Member 'BP_ValeriaPlayerController_C_CharacterStateIs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CharacterStateIs, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_ValeriaPlayerController_C_CharacterStateIs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CharacterStateIs, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_ValeriaPlayerController_C_CharacterStateIs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CharacterStateIs, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000028, "Member 'BP_ValeriaPlayerController_C_CharacterStateIs::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CharacterStateIs, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BP_ValeriaPlayerController_C_CharacterStateIs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CharacterStateIs, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BP_ValeriaPlayerController_C_CharacterStateIs::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CharacterStateIs, CallFunc_GetCSM_ReturnValue) == 0x000038, "Member 'BP_ValeriaPlayerController_C_CharacterStateIs::CallFunc_GetCSM_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CharacterStateIs, CallFunc_GetCurrentStateType_ReturnValue) == 0x000040, "Member 'BP_ValeriaPlayerController_C_CharacterStateIs::CallFunc_GetCurrentStateType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CharacterStateIs, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000041, "Member 'BP_ValeriaPlayerController_C_CharacterStateIs::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_ValeriaPlayerController.BP_ValeriaPlayerController_C.CharacterTeleported
// 0x0008 (0x0008 - 0x0000)
struct BP_ValeriaPlayerController_C_CharacterTeleported final 
{
public:
	class AValeriaPlayerController*               PC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaPlayerController_C_CharacterTeleported) == 0x000008, "Wrong alignment on BP_ValeriaPlayerController_C_CharacterTeleported");
static_assert(sizeof(BP_ValeriaPlayerController_C_CharacterTeleported) == 0x000008, "Wrong size on BP_ValeriaPlayerController_C_CharacterTeleported");
static_assert(offsetof(BP_ValeriaPlayerController_C_CharacterTeleported, PC) == 0x000000, "Member 'BP_ValeriaPlayerController_C_CharacterTeleported::PC' has a wrong offset!");

// Function BP_ValeriaPlayerController.BP_ValeriaPlayerController_C.CheckShouldUseCameraAssist
// 0x0040 (0x0040 - 0x0000)
struct BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist final 
{
public:
	bool                                          ShouldUseCameraAssist;                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ECC[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      Param_ValeriaCharacter;                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInClimbingMode;                                  // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEquippedInUse;                                   // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ECD[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaCharacterMoveComponent*         CallFunc_GetValeriaCharacterMovementComponent_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    CallFunc_GetEquipment_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInClimbingMode_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEquippedInUse_ReturnValue;              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist) == 0x000008, "Wrong alignment on BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist");
static_assert(sizeof(BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist) == 0x000040, "Wrong size on BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist");
static_assert(offsetof(BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist, ShouldUseCameraAssist) == 0x000000, "Member 'BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist::ShouldUseCameraAssist' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist, Param_ValeriaCharacter) == 0x000008, "Member 'BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist::Param_ValeriaCharacter' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist, IsInClimbingMode) == 0x000010, "Member 'BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist::IsInClimbingMode' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist, IsEquippedInUse) == 0x000011, "Member 'BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist::IsEquippedInUse' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist, CallFunc_GetValeriaCharacter_OutResult) == 0x000012, "Member 'BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000018, "Member 'BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist, CallFunc_GetValeriaCharacterMovementComponent_ReturnValue) == 0x000020, "Member 'BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist::CallFunc_GetValeriaCharacterMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist, CallFunc_GetEquipment_ReturnValue) == 0x000028, "Member 'BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist::CallFunc_GetEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist, CallFunc_IsInClimbingMode_ReturnValue) == 0x000030, "Member 'BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist::CallFunc_IsInClimbingMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist, CallFunc_IsEquippedInUse_ReturnValue) == 0x000031, "Member 'BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist::CallFunc_IsEquippedInUse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist, CallFunc_Not_PreBool_ReturnValue) == 0x000032, "Member 'BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist, CallFunc_Not_PreBool_ReturnValue_1) == 0x000033, "Member 'BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist, K2Node_SwitchEnum_CmpSuccess) == 0x000034, "Member 'BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000035, "Member 'BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist, CallFunc_BooleanAND_ReturnValue) == 0x000036, "Member 'BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist, CallFunc_BooleanAND_ReturnValue_1) == 0x000037, "Member 'BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist, CallFunc_BooleanAND_ReturnValue_2) == 0x000038, "Member 'BP_ValeriaPlayerController_C_CheckShouldUseCameraAssist::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function BP_ValeriaPlayerController.BP_ValeriaPlayerController_C.Client_Camera_TickInspoState
// 0x0004 (0x0004 - 0x0000)
struct BP_ValeriaPlayerController_C_Client_Camera_TickInspoState final 
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaPlayerController_C_Client_Camera_TickInspoState) == 0x000004, "Wrong alignment on BP_ValeriaPlayerController_C_Client_Camera_TickInspoState");
static_assert(sizeof(BP_ValeriaPlayerController_C_Client_Camera_TickInspoState) == 0x000004, "Wrong size on BP_ValeriaPlayerController_C_Client_Camera_TickInspoState");
static_assert(offsetof(BP_ValeriaPlayerController_C_Client_Camera_TickInspoState, DeltaTime) == 0x000000, "Member 'BP_ValeriaPlayerController_C_Client_Camera_TickInspoState::DeltaTime' has a wrong offset!");

// Function BP_ValeriaPlayerController.BP_ValeriaPlayerController_C.Client_HandleMapAreaTransformationNotification
// 0x0020 (0x0020 - 0x0000)
struct BP_ValeriaPlayerController_C_Client_HandleMapAreaTransformationNotification final 
{
public:
	EMapAreaTransformationNotificationType        NotificationType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ECE[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Location;                                          // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaPlayerController_C_Client_HandleMapAreaTransformationNotification) == 0x000008, "Wrong alignment on BP_ValeriaPlayerController_C_Client_HandleMapAreaTransformationNotification");
static_assert(sizeof(BP_ValeriaPlayerController_C_Client_HandleMapAreaTransformationNotification) == 0x000020, "Wrong size on BP_ValeriaPlayerController_C_Client_HandleMapAreaTransformationNotification");
static_assert(offsetof(BP_ValeriaPlayerController_C_Client_HandleMapAreaTransformationNotification, NotificationType) == 0x000000, "Member 'BP_ValeriaPlayerController_C_Client_HandleMapAreaTransformationNotification::NotificationType' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_Client_HandleMapAreaTransformationNotification, Location) == 0x000008, "Member 'BP_ValeriaPlayerController_C_Client_HandleMapAreaTransformationNotification::Location' has a wrong offset!");

// Function BP_ValeriaPlayerController.BP_ValeriaPlayerController_C.Client_SpawnEffectActor
// 0x00F0 (0x00F0 - 0x0000)
struct BP_ValeriaPlayerController_C_Client_SpawnEffectActor final 
{
public:
	struct FVAL_EffectActorSpawnParameters        SpawnParameters;                                   // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class AActor*                                 ReturnValue;                                       // 0x00C0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsBP_Arrow_Firework_A_Boom_Me; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ECF[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_arrow_fireworkA_BoomMe_C*           CallFunc_FinishSpawningActor_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ValeriaPlayerController_C_Client_SpawnEffectActor) == 0x000010, "Wrong alignment on BP_ValeriaPlayerController_C_Client_SpawnEffectActor");
static_assert(sizeof(BP_ValeriaPlayerController_C_Client_SpawnEffectActor) == 0x0000F0, "Wrong size on BP_ValeriaPlayerController_C_Client_SpawnEffectActor");
static_assert(offsetof(BP_ValeriaPlayerController_C_Client_SpawnEffectActor, SpawnParameters) == 0x000000, "Member 'BP_ValeriaPlayerController_C_Client_SpawnEffectActor::SpawnParameters' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_Client_SpawnEffectActor, ReturnValue) == 0x0000C0, "Member 'BP_ValeriaPlayerController_C_Client_SpawnEffectActor::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_Client_SpawnEffectActor, K2Node_ClassDynamicCast_AsBP_Arrow_Firework_A_Boom_Me) == 0x0000C8, "Member 'BP_ValeriaPlayerController_C_Client_SpawnEffectActor::K2Node_ClassDynamicCast_AsBP_Arrow_Firework_A_Boom_Me' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_Client_SpawnEffectActor, K2Node_ClassDynamicCast_bSuccess) == 0x0000D0, "Member 'BP_ValeriaPlayerController_C_Client_SpawnEffectActor::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_Client_SpawnEffectActor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000D8, "Member 'BP_ValeriaPlayerController_C_Client_SpawnEffectActor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_Client_SpawnEffectActor, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000E0, "Member 'BP_ValeriaPlayerController_C_Client_SpawnEffectActor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_ValeriaPlayerController.BP_ValeriaPlayerController_C.CreateUseEventParams
// 0x0070 (0x0070 - 0x0000)
struct BP_ValeriaPlayerController_C_CreateUseEventParams final 
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FUseEventParams                        UseEventParams;                                    // 0x0018(0x0028)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WasInputKeyJustPressed_ReturnValue;       // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUseEventType                                 Temp_byte_Variable;                                // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUseEventType                                 Temp_byte_Variable_1;                              // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUseEventType                                 K2Node_Select_Default;                             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED0[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUseEventParams                        K2Node_MakeStruct_UseEventParams;                  // 0x0048(0x0028)()
};
static_assert(alignof(BP_ValeriaPlayerController_C_CreateUseEventParams) == 0x000008, "Wrong alignment on BP_ValeriaPlayerController_C_CreateUseEventParams");
static_assert(sizeof(BP_ValeriaPlayerController_C_CreateUseEventParams) == 0x000070, "Wrong size on BP_ValeriaPlayerController_C_CreateUseEventParams");
static_assert(offsetof(BP_ValeriaPlayerController_C_CreateUseEventParams, Key) == 0x000000, "Member 'BP_ValeriaPlayerController_C_CreateUseEventParams::Key' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CreateUseEventParams, UseEventParams) == 0x000018, "Member 'BP_ValeriaPlayerController_C_CreateUseEventParams::UseEventParams' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CreateUseEventParams, Temp_bool_Variable) == 0x000040, "Member 'BP_ValeriaPlayerController_C_CreateUseEventParams::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CreateUseEventParams, CallFunc_WasInputKeyJustPressed_ReturnValue) == 0x000041, "Member 'BP_ValeriaPlayerController_C_CreateUseEventParams::CallFunc_WasInputKeyJustPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CreateUseEventParams, Temp_byte_Variable) == 0x000042, "Member 'BP_ValeriaPlayerController_C_CreateUseEventParams::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CreateUseEventParams, Temp_byte_Variable_1) == 0x000043, "Member 'BP_ValeriaPlayerController_C_CreateUseEventParams::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CreateUseEventParams, K2Node_Select_Default) == 0x000044, "Member 'BP_ValeriaPlayerController_C_CreateUseEventParams::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_CreateUseEventParams, K2Node_MakeStruct_UseEventParams) == 0x000048, "Member 'BP_ValeriaPlayerController_C_CreateUseEventParams::K2Node_MakeStruct_UseEventParams' has a wrong offset!");

// Function BP_ValeriaPlayerController.BP_ValeriaPlayerController_C.DoInteract
// 0x00A0 (0x00A0 - 0x0000)
struct BP_ValeriaPlayerController_C_DoInteract final 
{
public:
	EInteractEventIndex                           Param_Index;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Pressed;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasInteractHandled;                                // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED1[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      Param_Character;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          WasHandled;                                        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED2[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractorComponent*                   InteractorComponent;                               // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputType                                    Temp_byte_Variable_1;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputType                                    Temp_byte_Variable_2;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputType                                    Temp_byte_Variable_3;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputType                                    Temp_byte_Variable_4;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED3[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ECharacterState>                       K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	EInteractEventType                            Temp_byte_Variable_5;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CharacterStateIs_Contains;                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterState                               CallFunc_CharacterStateIs_State;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractEventType                            Temp_byte_Variable_6;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED4[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractorComponent*                   CallFunc_GetInteractorComponent_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED5[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED6[0x5];                                     // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EInteractEventType                            K2Node_Select_Default;                             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputType                                    K2Node_Select_Default_1;                           // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED7[0x5];                                     // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInteractEventParams                   K2Node_MakeStruct_InteractEventParams;             // 0x0070(0x0018)()
	struct FUseEventResults                       CallFunc_InteractWithHighlighted_ReturnValue;      // 0x0088(0x0018)()
};
static_assert(alignof(BP_ValeriaPlayerController_C_DoInteract) == 0x000008, "Wrong alignment on BP_ValeriaPlayerController_C_DoInteract");
static_assert(sizeof(BP_ValeriaPlayerController_C_DoInteract) == 0x0000A0, "Wrong size on BP_ValeriaPlayerController_C_DoInteract");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, Param_Index) == 0x000000, "Member 'BP_ValeriaPlayerController_C_DoInteract::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, Pressed) == 0x000001, "Member 'BP_ValeriaPlayerController_C_DoInteract::Pressed' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, WasInteractHandled) == 0x000002, "Member 'BP_ValeriaPlayerController_C_DoInteract::WasInteractHandled' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, Param_Character) == 0x000008, "Member 'BP_ValeriaPlayerController_C_DoInteract::Param_Character' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, WasHandled) == 0x000010, "Member 'BP_ValeriaPlayerController_C_DoInteract::WasHandled' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, InteractorComponent) == 0x000018, "Member 'BP_ValeriaPlayerController_C_DoInteract::InteractorComponent' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, Temp_byte_Variable) == 0x000020, "Member 'BP_ValeriaPlayerController_C_DoInteract::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, Temp_byte_Variable_1) == 0x000021, "Member 'BP_ValeriaPlayerController_C_DoInteract::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, Temp_byte_Variable_2) == 0x000022, "Member 'BP_ValeriaPlayerController_C_DoInteract::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, Temp_byte_Variable_3) == 0x000023, "Member 'BP_ValeriaPlayerController_C_DoInteract::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, Temp_byte_Variable_4) == 0x000024, "Member 'BP_ValeriaPlayerController_C_DoInteract::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, K2Node_MakeArray_Array) == 0x000028, "Member 'BP_ValeriaPlayerController_C_DoInteract::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, Temp_byte_Variable_5) == 0x000038, "Member 'BP_ValeriaPlayerController_C_DoInteract::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, CallFunc_CharacterStateIs_Contains) == 0x000039, "Member 'BP_ValeriaPlayerController_C_DoInteract::CallFunc_CharacterStateIs_Contains' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, CallFunc_CharacterStateIs_State) == 0x00003A, "Member 'BP_ValeriaPlayerController_C_DoInteract::CallFunc_CharacterStateIs_State' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, Temp_byte_Variable_6) == 0x00003B, "Member 'BP_ValeriaPlayerController_C_DoInteract::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, CallFunc_GetInteractorComponent_ReturnValue) == 0x000040, "Member 'BP_ValeriaPlayerController_C_DoInteract::CallFunc_GetInteractorComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, CallFunc_GetValeriaCharacter_OutResult) == 0x000048, "Member 'BP_ValeriaPlayerController_C_DoInteract::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000050, "Member 'BP_ValeriaPlayerController_C_DoInteract::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, K2Node_SwitchEnum_CmpSuccess) == 0x000058, "Member 'BP_ValeriaPlayerController_C_DoInteract::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'BP_ValeriaPlayerController_C_DoInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, Temp_bool_Variable) == 0x00005A, "Member 'BP_ValeriaPlayerController_C_DoInteract::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000060, "Member 'BP_ValeriaPlayerController_C_DoInteract::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, K2Node_Select_Default) == 0x000068, "Member 'BP_ValeriaPlayerController_C_DoInteract::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, CallFunc_GetCurrentInputType_ReturnValue) == 0x000069, "Member 'BP_ValeriaPlayerController_C_DoInteract::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ValeriaPlayerController_C_DoInteract, K2Node_Select_Default_1) == 0x00006A, "Member 'BP_ValeriaPlayerController_C_DoInteract::K2Node_Select_Default_1' has a wrong offset!");
