#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MAP_Character_Lighting_CharacterCreation_LevelInstance_3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MAP_Character_Lighting_CharacterCreation_LevelInstance_3.MAP_Character_Lighting_CharacterCreation_C.ExecuteUbergraph_MAP_Character_Lighting_CharacterCreation
// 0x0048 (0x0048 - 0x0000)
struct MAP_Character_Lighting_CharacterCreation_C_ExecuteUbergraph_MAP_Character_Lighting_CharacterCreation final 
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_576B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLightColor_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MAP_Character_Lighting_CharacterCreation_C_ExecuteUbergraph_MAP_Character_Lighting_CharacterCreation) == 0x000008, "Wrong alignment on MAP_Character_Lighting_CharacterCreation_C_ExecuteUbergraph_MAP_Character_Lighting_CharacterCreation");
static_assert(sizeof(MAP_Character_Lighting_CharacterCreation_C_ExecuteUbergraph_MAP_Character_Lighting_CharacterCreation) == 0x000048, "Wrong size on MAP_Character_Lighting_CharacterCreation_C_ExecuteUbergraph_MAP_Character_Lighting_CharacterCreation");
static_assert(offsetof(MAP_Character_Lighting_CharacterCreation_C_ExecuteUbergraph_MAP_Character_Lighting_CharacterCreation, EntryPoint) == 0x000000, "Member 'MAP_Character_Lighting_CharacterCreation_C_ExecuteUbergraph_MAP_Character_Lighting_CharacterCreation::EntryPoint' has a wrong offset!");
static_assert(offsetof(MAP_Character_Lighting_CharacterCreation_C_ExecuteUbergraph_MAP_Character_Lighting_CharacterCreation, CallFunc_GetForwardVector_ReturnValue) == 0x000008, "Member 'MAP_Character_Lighting_CharacterCreation_C_ExecuteUbergraph_MAP_Character_Lighting_CharacterCreation::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MAP_Character_Lighting_CharacterCreation_C_ExecuteUbergraph_MAP_Character_Lighting_CharacterCreation, CallFunc_GetLightColor_ReturnValue) == 0x000020, "Member 'MAP_Character_Lighting_CharacterCreation_C_ExecuteUbergraph_MAP_Character_Lighting_CharacterCreation::CallFunc_GetLightColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MAP_Character_Lighting_CharacterCreation_C_ExecuteUbergraph_MAP_Character_Lighting_CharacterCreation, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000030, "Member 'MAP_Character_Lighting_CharacterCreation_C_ExecuteUbergraph_MAP_Character_Lighting_CharacterCreation::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MAP_Character_Lighting_CharacterCreation_C_ExecuteUbergraph_MAP_Character_Lighting_CharacterCreation, K2Node_Event_EndPlayReason) == 0x000040, "Member 'MAP_Character_Lighting_CharacterCreation_C_ExecuteUbergraph_MAP_Character_Lighting_CharacterCreation::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function MAP_Character_Lighting_CharacterCreation_LevelInstance_3.MAP_Character_Lighting_CharacterCreation_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct MAP_Character_Lighting_CharacterCreation_C_ReceiveEndPlay final 
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MAP_Character_Lighting_CharacterCreation_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on MAP_Character_Lighting_CharacterCreation_C_ReceiveEndPlay");
static_assert(sizeof(MAP_Character_Lighting_CharacterCreation_C_ReceiveEndPlay) == 0x000001, "Wrong size on MAP_Character_Lighting_CharacterCreation_C_ReceiveEndPlay");
static_assert(offsetof(MAP_Character_Lighting_CharacterCreation_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'MAP_Character_Lighting_CharacterCreation_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

}

