#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TopBacker_02

#include "Basic.hpp"

#include "BP_TopBackerSettings_Popup_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TopBacker_02.WBP_TopBacker_02_C
// 0x0078 (0x02F0 - 0x0278)
class UWBP_TopBacker_02_C final  : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnOpen;                                            // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_Container;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LeftArrow;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RightArrow;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Header;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                Text_Header;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FBP_TopBackerSettings_Popup            BackerSettings;                                    // 0x02B0(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void ApplyBackerSettings(const struct FBP_TopBackerSettings_Popup& Settings, class UOverlaySlot* CallFunc_SlotAsOverlaySlot_ReturnValue, class UHorizontalBoxSlot* CallFunc_SlotAsHorizontalBoxSlot_ReturnValue, class UOverlaySlot* CallFunc_SlotAsOverlaySlot_ReturnValue_1);
	void Construct();
	void ExecuteUbergraph_WBP_TopBacker_02(int32 EntryPoint, bool K2Node_Event_IsDesignTime);
	void PlayAnim(class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);
	void PreConstruct(bool IsDesignTime);
	void SetHeaderText(class FText Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TopBacker_02_C">();
	}
	static class UWBP_TopBacker_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TopBacker_02_C>();
	}
};
static_assert(alignof(UWBP_TopBacker_02_C) == 0x000008, "Wrong alignment on UWBP_TopBacker_02_C");
static_assert(sizeof(UWBP_TopBacker_02_C) == 0x0002F0, "Wrong size on UWBP_TopBacker_02_C");
static_assert(offsetof(UWBP_TopBacker_02_C, UberGraphFrame) == 0x000278, "Member 'UWBP_TopBacker_02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TopBacker_02_C, OnOpen) == 0x000280, "Member 'UWBP_TopBacker_02_C::OnOpen' has a wrong offset!");
static_assert(offsetof(UWBP_TopBacker_02_C, HBox_Container) == 0x000288, "Member 'UWBP_TopBacker_02_C::HBox_Container' has a wrong offset!");
static_assert(offsetof(UWBP_TopBacker_02_C, Image_LeftArrow) == 0x000290, "Member 'UWBP_TopBacker_02_C::Image_LeftArrow' has a wrong offset!");
static_assert(offsetof(UWBP_TopBacker_02_C, Image_RightArrow) == 0x000298, "Member 'UWBP_TopBacker_02_C::Image_RightArrow' has a wrong offset!");
static_assert(offsetof(UWBP_TopBacker_02_C, Overlay_Header) == 0x0002A0, "Member 'UWBP_TopBacker_02_C::Overlay_Header' has a wrong offset!");
static_assert(offsetof(UWBP_TopBacker_02_C, Text_Header) == 0x0002A8, "Member 'UWBP_TopBacker_02_C::Text_Header' has a wrong offset!");
static_assert(offsetof(UWBP_TopBacker_02_C, BackerSettings) == 0x0002B0, "Member 'UWBP_TopBacker_02_C::BackerSettings' has a wrong offset!");

}

