#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GPPopup_QuickModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ValeriaUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GPPopup_QuickModal.WBP_GPPopup_QuickModal_C
// 0x0028 (0x0558 - 0x0530)
class UWBP_GPPopup_QuickModal_C final  : public UVALUI_GpInteractivePopupBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_RichTextBlock_Styled*            Description;                                       // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_74;                                          // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_RichTextBlock_Styled*            Title;                                             // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Primary_01_CM_C*   WBP_Template_Button_Primary_01_CM;                 // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GPPopup_QuickModal_WBP_Template_Button_Primary_01_CM_K2Node_ComponentBoundEvent_0_ButtonClicked__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_GPPopup_QuickModal(int32 EntryPoint, const struct FInputActionValue& K2Node_Event_ActionValue, float K2Node_Event_ElapsedTime, float K2Node_Event_TriggeredTime, class UInputAction* K2Node_Event_SourceAction, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, class UObject* CallFunc_LoadAsset_Blocking_ReturnValue, class UTexture2D* K2Node_DynamicCast_AsTexture_2D, bool K2Node_DynamicCast_bSuccess, const struct FSlateBrush& CallFunc_MakeBrushFromTexture_ReturnValue);
	void HandleInputAction_UIBack_Triggered(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GPPopup_QuickModal_C">();
	}
	static class UWBP_GPPopup_QuickModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GPPopup_QuickModal_C>();
	}
};
static_assert(alignof(UWBP_GPPopup_QuickModal_C) == 0x000008, "Wrong alignment on UWBP_GPPopup_QuickModal_C");
static_assert(sizeof(UWBP_GPPopup_QuickModal_C) == 0x000558, "Wrong size on UWBP_GPPopup_QuickModal_C");
static_assert(offsetof(UWBP_GPPopup_QuickModal_C, UberGraphFrame) == 0x000530, "Member 'UWBP_GPPopup_QuickModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_QuickModal_C, Description) == 0x000538, "Member 'UWBP_GPPopup_QuickModal_C::Description' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_QuickModal_C, Image_74) == 0x000540, "Member 'UWBP_GPPopup_QuickModal_C::Image_74' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_QuickModal_C, Title) == 0x000548, "Member 'UWBP_GPPopup_QuickModal_C::Title' has a wrong offset!");
static_assert(offsetof(UWBP_GPPopup_QuickModal_C, WBP_Template_Button_Primary_01_CM) == 0x000550, "Member 'UWBP_GPPopup_QuickModal_C::WBP_Template_Button_Primary_01_CM' has a wrong offset!");

}

