#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SocialWindow_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SocialPanelConfig_structs.hpp"
#include "ValeriaUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SocialWindow_CM.WBP_SocialWindow_CM_C
// 0x0148 (0x0648 - 0x0500)
class UWBP_SocialWindow_CM_C final  : public UVALUI_SocialPanelBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonActionWidget*                    CommonActionWidget_65;                             // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonInputActionWidget_C*         CommonInputActionWidget_LB;                        // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonInputActionWidget_C*         CommonInputActionWidget_RB;                        // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_SocialPanel;                               // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IconButton_CM_C*                   PhotoModeButton;                                   // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_TabContent;                               // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Social_TabHost_C*                  TabButtonHost;                                     // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                Text_CurrentTabName;                               // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ValeriagramFeedPanel_C*            ValeriagramFeedPanel;                              // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CloseButton_CM_C*                  WBP_CloseButton_CM;                                // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RequestsPanel_CM_C*                WBP_RequestsPanel_CM;                              // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SocialConnectionsPanel_CM_C*       WBP_SocialConnectionsPanel_CM;                     // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SocialWindow_PartyRow_CM_C*        WBP_SocialWindow_PartyRow_CM;                      // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UObject*>                        PartyRowWidgets;                                   // 0x0570(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWBP_PopinCalloutWidget_C*              Menu_Content;                                      // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CharacterCardPreviousTabName;                      // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SocialConnectionRequestsCount;                     // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemRequestsCount;                                 // 0x0594(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnTotalRequestCountChanged;                        // 0x0598(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FBP_SocialPanelConfig                  Config;                                            // 0x05A8(0x0007)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          DebugSimulationEnabled;                            // 0x05AF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowCloseButton;                                   // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_5501[0x7];                                     // 0x05B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnClose;                                           // 0x05B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TSoftObjectPtr<class UVAL_TutorialFlagDefinition> Requests_Flag;                                     // 0x05C8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnNumFriendsOnlineChanged;                         // 0x05F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TSoftObjectPtr<class UVAL_TutorialFlagDefinition> SocialPanelFlag;                                   // 0x0608(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetInputExtended*  PreviousActivatedWidget;                           // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar;                                            // 0x0640(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__TabButtonHost_K2Node_ComponentBoundEvent_3_OnDifferentActiveTabSet__DelegateSignature(class UVALUI_TabButtonHostBase* Param_TabButtonHost);
	void BndEvt__WBP_SocialWindow_CM_PhotoModeButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WBP_SocialWindow_CM_WBP_CloseButton_CM_K2Node_ComponentBoundEvent_0_OnButtonClicked__DelegateSignature();
	void BndEvt__WBP_SocialWindow_CM_WBP_SocialConnectionsPanel_CM_K2Node_ComponentBoundEvent_11_OnSocialConnectionOnlineFriendsChange__DelegateSignature(int32 NumOnline);
	void BndEvt__WBP_SocialWindow_CM_WBP_SocialConnectionsPanel_CM_K2Node_ComponentBoundEvent_12_OnSocialConnectionRequestsCountChanged__DelegateSignature(int32 Count);
	void BndEvt__WBP_SocialWindow_CM_WBP_SocialConnectionsPanel_CM_K2Node_ComponentBoundEvent_13_OnCharacterCardBackButtonClicked__DelegateSignature(class UWBP_PlayerCharacterInspectionCard_CM_C* CharacterCardWidget, class UWBP_SocialConnectionsPanel_CM_C* SocialConnectionsPanelWidget);
	void BndEvt__WBP_SocialWindow_CM_WBP_SocialConnectionsPanel_CM_K2Node_ComponentBoundEvent_14_OnInspectPlayerCharacter__DelegateSignature(const struct FUniqueNetIdRepl& UserId);
	void BndEvt__WBP_SocialWindow_CM_WBP_SocialWindow_PartyRow_CM_K2Node_ComponentBoundEvent_2_OnPartyCreated__DelegateSignature();
	void BndEvt__WBP_SocialWindow_CM_WBP_SocialWindow_PartyRow_CM_K2Node_ComponentBoundEvent_4_OnInspectPlayerCharacter__DelegateSignature(const struct FUniqueNetIdRepl& UserId);
	bool BP_OnHandleBackAction();
	void Close(class FName CallFunc_GetActiveTabName_ReturnValue, const struct FVALUI_InstantiatedTabButtonInfo& CallFunc_TryGetTabInfo_OutInfo, bool CallFunc_TryGetTabInfo_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, class UCommonActivatableWidgetInputExtended* K2Node_DynamicCast_AsCommon_Activatable_Widget_Input_Extended, bool K2Node_DynamicCast_bSuccess);
	void CloseHandle();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_SocialWindow_CM(int32 EntryPoint, class UVALUI_TabButtonHostBase* K2Node_ComponentBoundEvent_TabButtonHost, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue_2, float K2Node_EnhancedInputActionEvent_ElapsedTime_2, float K2Node_EnhancedInputActionEvent_TriggeredTime_2, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction_2, class FName CallFunc_GetActiveTabName_ReturnValue, bool CallFunc_Conv_InputActionValueToBool_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue_1, const struct FVALUI_InstantiatedTabButtonInfo& CallFunc_TryGetTabInfo_OutInfo, bool CallFunc_TryGetTabInfo_ReturnValue, class UInputAction* Temp_object_Variable, double Temp_real_Variable, class UCommonActivatableWidgetInputExtended* K2Node_DynamicCast_AsCommon_Activatable_Widget_Input_Extended, bool K2Node_DynamicCast_bSuccess, double Temp_real_Variable_0, double Temp_real_Variable_1, bool Temp_bool_Variable, double Temp_real_Variable_1_0, bool CallFunc_IsValid_ReturnValue, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue_1, float K2Node_EnhancedInputActionEvent_ElapsedTime_1, float K2Node_EnhancedInputActionEvent_TriggeredTime_1, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction_1, class UInputAction* Temp_object_Variable_1, bool CallFunc_Conv_InputActionValueToBool_ReturnValue_1, double Temp_real_Variable_2, double Temp_real_Variable_3, double Temp_real_Variable_2_0, double Temp_real_Variable_3_0, bool Temp_bool_Variable_1, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue, float K2Node_EnhancedInputActionEvent_ElapsedTime, float K2Node_EnhancedInputActionEvent_TriggeredTime, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction, bool CallFunc_Conv_InputActionValueToBool_ReturnValue_2, class UInputAction* Temp_object_Variable_2, double Temp_real_Variable_4, double Temp_real_Variable_4_0, double Temp_real_Variable_5, bool Temp_bool_Variable_2, double Temp_real_Variable_5_0, bool Temp_bool_Variable_3, ESlateVisibility K2Node_CustomEvent_InVisibility, TSet<ESlateVisibility>& K2Node_MakeSet_Set, double Temp_real_Variable_6, bool CallFunc_Set_Contains_ReturnValue, double Temp_real_Variable_7, class UInputAction* Temp_object_Variable_3, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue_3, float K2Node_EnhancedInputActionEvent_ElapsedTime_3, float K2Node_EnhancedInputActionEvent_TriggeredTime_3, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction_3, double Temp_real_Variable_7_0, double Temp_real_Variable_6_0, bool CallFunc_Conv_InputActionValueToBool_ReturnValue_3, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate_1, bool CallFunc_TrySetActiveTabName_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, TDelegate<void(bool bDisplay)> K2Node_CreateDelegate_OutputDelegate_2, bool K2Node_Event_IsDesignTime, int32 CallFunc_AkEventGlobal_ReturnValue_1, int32 K2Node_ComponentBoundEvent_NumOnline, int32 K2Node_ComponentBoundEvent_Count, class UWBP_PlayerCharacterInspectionCard_CM_C* K2Node_ComponentBoundEvent_CharacterCardWidget, class UWBP_SocialConnectionsPanel_CM_C* K2Node_ComponentBoundEvent_SocialConnectionsPanelWidget, const struct FUniqueNetIdRepl& K2Node_ComponentBoundEvent_UserId_1, const struct FUniqueNetIdRepl& K2Node_ComponentBoundEvent_UserId, class UVAL_TutorialFlagsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class UVAL_TutorialFlagsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, bool CallFunc_CanStartTutorialForFlag_ReturnValue, bool CallFunc_CanStartTutorialForFlag_ReturnValue_1, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, bool Temp_bool_Variable_4, ESlateVisibility K2Node_Select_Default);
	void ForceRefreshActiveTab(class FName CallFunc_GetActiveTabName_ReturnValue, bool K2Node_SwitchName_CmpSuccess, const struct FVALUI_InstantiatedTabButtonInfo& CallFunc_TryGetTabInfo_OutInfo, bool CallFunc_TryGetTabInfo_ReturnValue);
	class US6UI_InputActionHandlingWidgetComponent* GetInputActionHandlingComponent();
	void GetWidget(class UVALUI_SocialPanelBase** Widget);
	void HandleInputActionSwitchTab(bool LeftSwitch, int32 NextIndex, TArray<class FName>& CallFunc_GetTabNames_ReturnValue, TArray<class FName>& CallFunc_GetTabNames_ReturnValue_1, class FName CallFunc_GetActiveTabName_ReturnValue, int32 CallFunc_Array_Find_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class FName CallFunc_Array_Get_Item, bool CallFunc_TrySetActiveTabName_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue);
	void HandleOnToggleDebugSimulation(bool bDisplay);
	void HandleOpenRequestsTutorialModal(class UUserWidget* ModalWidget, TArray<class UUserWidget*>& TutorialWidgets, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, TScriptInterface<class IBP_ModalInterface_Tutorial_C> K2Node_DynamicCast_AsBP_Modal_Interface_Tutorial, bool K2Node_DynamicCast_bSuccess, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue);
	void HandleOpenSocialPanelTutorialModal(class UUserWidget* ModalWidget, TArray<class UUserWidget*>& TutorialWidgets, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, TScriptInterface<class IBP_ModalInterface_Tutorial_C> K2Node_DynamicCast_AsBP_Modal_Interface_Tutorial, bool K2Node_DynamicCast_bSuccess, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue);
	void InpActEvt_IA_ToggleSocialPanel_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SocialWindow_OpenCamera_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void IsValeriagramOpen_(bool* Result, class FName CallFunc_GetActiveTabName_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue);
	void OnClose__DelegateSignature();
	void OnInitialized();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void OnNumFriendsOnlineChanged__DelegateSignature(int32 NumOnline);
	void OnTotalRequestCountChanged__DelegateSignature(int32 TotalCount);
	void OnVisibilityChanged_Event(ESlateVisibility InVisibility);
	void OpenCharacterCard(const struct FUniqueNetIdRepl& UserId);
	void OpenHandle();
	void PreConstruct(bool IsDesignTime);
	void Set_Valeriagram(bool CallFunc_TrySetActiveTabName_ReturnValue);
	void TryShowRequestsFTUE(class UVAL_TutorialFlagsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue, TDelegate<void(class UUserWidget* ModalWidget, TArray<class UUserWidget*>& TutorialWidgets)> K2Node_CreateDelegate_OutputDelegate, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, TScriptInterface<class IBPI_GameplayUIManagerTutorial_CM_C> K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM, bool K2Node_DynamicCast_bSuccess, bool CallFunc_RedirectTutorialModalType_bSuccess);
	void TryShowSocialPanelFTUE(class UVAL_TutorialFlagsManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, TScriptInterface<class IBPI_GameplayUIManagerTutorial_CM_C> K2Node_DynamicCast_AsBPI_Gameplay_UIManager_Tutorial_CM, bool K2Node_DynamicCast_bSuccess, TDelegate<void(class UUserWidget* ModalWidget, TArray<class UUserWidget*>& TutorialWidgets)> K2Node_CreateDelegate_OutputDelegate, bool CallFunc_RedirectTutorialModalType_bSuccess);
	void UpdateFromConfig(ESlateVisibility Temp_byte_Variable, class FName Temp_name_Variable, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable_1, ESlateVisibility Temp_byte_Variable_2, class FName Temp_name_Variable_1, bool Temp_bool_Variable_1, ESlateVisibility Temp_byte_Variable_3, ESlateVisibility Temp_byte_Variable_4, class FName Temp_name_Variable_2, ESlateVisibility Temp_byte_Variable_5, bool Temp_bool_Variable_2, class UAuthManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, const struct FUniqueNetIdRepl& CallFunc_GetNetId_ReturnValue, class UPresenceManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, const struct FPresence& CallFunc_GetPresenceForUserId_ReturnValue, ESlateVisibility K2Node_Select_Default, bool CallFunc_IsFTUEMapOrExperience_ReturnValue, ESlateVisibility K2Node_Select_Default_1, ESlateVisibility K2Node_Select_Default_2);
	void UpdateLongPollingForTabs(bool bAllowLongPolling, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class FName CallFunc_GetActiveTabName_ReturnValue, TArray<class FName>& CallFunc_GetTabNames_ReturnValue, class FName CallFunc_Array_Get_Item, class FName CallFunc_GetActiveTabName_ReturnValue_1, bool CallFunc_NotEqual_NameName_ReturnValue, bool K2Node_SwitchName_CmpSuccess, bool K2Node_SwitchName_CmpSuccess_1, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanOR_ReturnValue);
	void UpdateRequestCountDisplay(int32 CallFunc_Add_IntInt_ReturnValue);

	class UWidget* BP_GetDesiredFocusTarget(class UWidget* CallFunc_GetDesiredFocusTarget_ReturnValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SocialWindow_CM_C">();
	}
	static class UWBP_SocialWindow_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SocialWindow_CM_C>();
	}
};
static_assert(alignof(UWBP_SocialWindow_CM_C) == 0x000008, "Wrong alignment on UWBP_SocialWindow_CM_C");
static_assert(sizeof(UWBP_SocialWindow_CM_C) == 0x000648, "Wrong size on UWBP_SocialWindow_CM_C");
static_assert(offsetof(UWBP_SocialWindow_CM_C, UberGraphFrame) == 0x000500, "Member 'UWBP_SocialWindow_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, CommonActionWidget_65) == 0x000508, "Member 'UWBP_SocialWindow_CM_C::CommonActionWidget_65' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, CommonInputActionWidget_LB) == 0x000510, "Member 'UWBP_SocialWindow_CM_C::CommonInputActionWidget_LB' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, CommonInputActionWidget_RB) == 0x000518, "Member 'UWBP_SocialWindow_CM_C::CommonInputActionWidget_RB' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, Overlay_SocialPanel) == 0x000520, "Member 'UWBP_SocialWindow_CM_C::Overlay_SocialPanel' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, PhotoModeButton) == 0x000528, "Member 'UWBP_SocialWindow_CM_C::PhotoModeButton' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, Switcher_TabContent) == 0x000530, "Member 'UWBP_SocialWindow_CM_C::Switcher_TabContent' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, TabButtonHost) == 0x000538, "Member 'UWBP_SocialWindow_CM_C::TabButtonHost' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, Text_CurrentTabName) == 0x000540, "Member 'UWBP_SocialWindow_CM_C::Text_CurrentTabName' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, ValeriagramFeedPanel) == 0x000548, "Member 'UWBP_SocialWindow_CM_C::ValeriagramFeedPanel' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, WBP_CloseButton_CM) == 0x000550, "Member 'UWBP_SocialWindow_CM_C::WBP_CloseButton_CM' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, WBP_RequestsPanel_CM) == 0x000558, "Member 'UWBP_SocialWindow_CM_C::WBP_RequestsPanel_CM' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, WBP_SocialConnectionsPanel_CM) == 0x000560, "Member 'UWBP_SocialWindow_CM_C::WBP_SocialConnectionsPanel_CM' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, WBP_SocialWindow_PartyRow_CM) == 0x000568, "Member 'UWBP_SocialWindow_CM_C::WBP_SocialWindow_PartyRow_CM' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, PartyRowWidgets) == 0x000570, "Member 'UWBP_SocialWindow_CM_C::PartyRowWidgets' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, Menu_Content) == 0x000580, "Member 'UWBP_SocialWindow_CM_C::Menu_Content' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, CharacterCardPreviousTabName) == 0x000588, "Member 'UWBP_SocialWindow_CM_C::CharacterCardPreviousTabName' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, SocialConnectionRequestsCount) == 0x000590, "Member 'UWBP_SocialWindow_CM_C::SocialConnectionRequestsCount' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, ItemRequestsCount) == 0x000594, "Member 'UWBP_SocialWindow_CM_C::ItemRequestsCount' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, OnTotalRequestCountChanged) == 0x000598, "Member 'UWBP_SocialWindow_CM_C::OnTotalRequestCountChanged' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, Config) == 0x0005A8, "Member 'UWBP_SocialWindow_CM_C::Config' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, DebugSimulationEnabled) == 0x0005AF, "Member 'UWBP_SocialWindow_CM_C::DebugSimulationEnabled' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, ShowCloseButton) == 0x0005B0, "Member 'UWBP_SocialWindow_CM_C::ShowCloseButton' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, OnClose) == 0x0005B8, "Member 'UWBP_SocialWindow_CM_C::OnClose' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, Requests_Flag) == 0x0005C8, "Member 'UWBP_SocialWindow_CM_C::Requests_Flag' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, OnNumFriendsOnlineChanged) == 0x0005F8, "Member 'UWBP_SocialWindow_CM_C::OnNumFriendsOnlineChanged' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, SocialPanelFlag) == 0x000608, "Member 'UWBP_SocialWindow_CM_C::SocialPanelFlag' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, PreviousActivatedWidget) == 0x000638, "Member 'UWBP_SocialWindow_CM_C::PreviousActivatedWidget' has a wrong offset!");
static_assert(offsetof(UWBP_SocialWindow_CM_C, NewVar) == 0x000640, "Member 'UWBP_SocialWindow_CM_C::NewVar' has a wrong offset!");

}

