#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GraphicsSettings_ConfirmationWindow_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S6UICore_structs.hpp"
#include "ValeriaUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GraphicsSettings_ConfirmationWindow_CM.WBP_GraphicsSettings_ConfirmationWindow_CM_C
// 0x0048 (0x0570 - 0x0528)
class UWBP_GraphicsSettings_ConfirmationWindow_CM_C final  : public UVALUI_ModalWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_TextBlock_Styled*                VALUI_TextBlock_Styled_62;                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_PopupSecondary_02_CM_C*   WBP_Template_PopupSecondary_02_CM;                 // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnConfirm;                                         // 0x0540(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnCancel;                                          // 0x0550(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Timer;                                             // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C65[0x4];                                     // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CountDown_Timer;                                   // 0x0568(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_GraphicsSettings_ConfirmationWindow_CM_WBP_Template_PopupSecondary_02_CM_K2Node_ComponentBoundEvent_0_Cancel__DelegateSignature();
	void BndEvt__WBP_GraphicsSettings_ConfirmationWindow_CM_WBP_Template_PopupSecondary_02_CM_K2Node_ComponentBoundEvent_1_Confirm__DelegateSignature();
	bool CanClose(ES6UI_ModalWidgetState CallFunc_GetModalWidgetState_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void Construct();
	void Countdown();
	void ExecuteUbergraph_WBP_GraphicsSettings_ConfirmationWindow_CM(int32 EntryPoint, int32 Temp_int_Variable, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, int64 CallFunc_Conv_IntToInt64_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue);
	void HandleStartClosing_BP(bool bPermitLatentClosing, bool* bOutHasLatentClosingLogic);
	void HandleStartOpening_BP(bool* bOutHasLatentOpeningLogic);
	void OnCancel__DelegateSignature();
	void OnConfirm__DelegateSignature();
	void OnInitialized();
	void OnWidgetClose(class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GraphicsSettings_ConfirmationWindow_CM_C">();
	}
	static class UWBP_GraphicsSettings_ConfirmationWindow_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GraphicsSettings_ConfirmationWindow_CM_C>();
	}
};
static_assert(alignof(UWBP_GraphicsSettings_ConfirmationWindow_CM_C) == 0x000008, "Wrong alignment on UWBP_GraphicsSettings_ConfirmationWindow_CM_C");
static_assert(sizeof(UWBP_GraphicsSettings_ConfirmationWindow_CM_C) == 0x000570, "Wrong size on UWBP_GraphicsSettings_ConfirmationWindow_CM_C");
static_assert(offsetof(UWBP_GraphicsSettings_ConfirmationWindow_CM_C, UberGraphFrame) == 0x000528, "Member 'UWBP_GraphicsSettings_ConfirmationWindow_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_ConfirmationWindow_CM_C, VALUI_TextBlock_Styled_62) == 0x000530, "Member 'UWBP_GraphicsSettings_ConfirmationWindow_CM_C::VALUI_TextBlock_Styled_62' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_ConfirmationWindow_CM_C, WBP_Template_PopupSecondary_02_CM) == 0x000538, "Member 'UWBP_GraphicsSettings_ConfirmationWindow_CM_C::WBP_Template_PopupSecondary_02_CM' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_ConfirmationWindow_CM_C, OnConfirm) == 0x000540, "Member 'UWBP_GraphicsSettings_ConfirmationWindow_CM_C::OnConfirm' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_ConfirmationWindow_CM_C, OnCancel) == 0x000550, "Member 'UWBP_GraphicsSettings_ConfirmationWindow_CM_C::OnCancel' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_ConfirmationWindow_CM_C, Timer) == 0x000560, "Member 'UWBP_GraphicsSettings_ConfirmationWindow_CM_C::Timer' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicsSettings_ConfirmationWindow_CM_C, CountDown_Timer) == 0x000568, "Member 'UWBP_GraphicsSettings_ConfirmationWindow_CM_C::CountDown_Timer' has a wrong offset!");

}

