#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Template_PopupSecondary_02_PF

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Template_PopupSecondary_02_PF.WBP_Template_PopupSecondary_02_PF_C
// 0x0278 (0x04F0 - 0x0278)
class UWBP_Template_PopupSecondary_02_PF_C final  : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Template_Button_Primary_01_CM_C*   Button_Primary_Confirm_CM;                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Secondary_01_CM_C* Button_Secondary_Cancel_CM;                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Secondary_01_CM_C* Button_Secondary_PrimaryAction_CM;                 // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_Secondary_01_CM_C* Button_Secondary_SecondaryAction_CM;               // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               Buttons;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_Body;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TopBacker_02_C*                    WBP_TopBacker_Popup;                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             Cancel;                                            // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             Confirm;                                           // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   Primary_Button_Text;                               // 0x02D8(0x0018)(Edit, BlueprintVisible)
	class FText                                   SecondaryButtonText;                               // 0x02F0(0x0018)(Edit, BlueprintVisible)
	class FText                                   HeaderText;                                        // 0x0308(0x0018)(Edit, BlueprintVisible)
	bool                                          OnlyConfirm;                                       // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnlyCancel;                                        // 0x0321(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoButtons;                                         // 0x0322(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_478E[0x1];                                     // 0x0323(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                ContentPadding;                                    // 0x0324(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_478F[0x4];                                     // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ButtonConfirmStyleOverride;                        // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ButtonCancelStyleOverride;                         // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlockStyle*                  TextStyle_ButtonPrimary;                           // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlockStyle*                  TextStyle_ButtonPrimaryPressed;                    // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlockStyle*                  TextStyle_ButtonSecondary;                         // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_Button_Confirm_Click;                           // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_Button_Cancel_Click;                            // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_Button_Cancel_Hover;                            // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_Button_Confirm_Hover;                           // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_Popup_Construct;                                // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4790[0x8];                                     // 0x0388(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CancelIconOverride;                                // 0x0390(0x00D0)(Edit, BlueprintVisible)
	class UInputAction*                           ConfirmInputAction;                                // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           CancelInputAction;                                 // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShowPrimaryActionButton;                         // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShowSecondaryActionButton;                       // 0x0471(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4791[0x6];                                     // 0x0472(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PrimaryActionButtonText;                           // 0x0478(0x0018)(Edit, BlueprintVisible)
	class FText                                   SecondaryActionButtonText;                         // 0x0490(0x0018)(Edit, BlueprintVisible)
	class UInputAction*                           PrimaryAction_InputAction;                         // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             PrimaryAction;                                     // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             SecondaryAction;                                   // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          PrimaryAction_ShowImage;                           // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PrimaryAction_BoundButton;                         // 0x04D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4792[0x6];                                     // 0x04D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           SecondaryAction_InputAction;                       // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          SecondaryAction_ShowImage;                         // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SecondaryAction_BoundButton;                       // 0x04E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CancelIA_ShowImage;                                // 0x04E2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CancelIA_BoundButton;                              // 0x04E3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ConfirmIA_ShowImage;                               // 0x04E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ConfirmIA_BoundButton;                             // 0x04E5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHeaderToLeft;                                    // 0x04E6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Template_PopupSecondary_02_PF_Back_Button_K2Node_ComponentBoundEvent_4_OnButtonClicked__DelegateSignature();
	void BndEvt__WBP_Template_PopupSecondary_02_PF_Back_Button_K2Node_ComponentBoundEvent_6_OnButtonHovered__DelegateSignature();
	void BndEvt__WBP_Template_PopupSecondary_02_PF_Button_Secondary_PrimaryAction_CM_K2Node_ComponentBoundEvent_1_OnButtonClicked__DelegateSignature();
	void BndEvt__WBP_Template_PopupSecondary_02_PF_Button_Secondary_SecondaryAction_CM_K2Node_ComponentBoundEvent_0_OnButtonClicked__DelegateSignature();
	void BndEvt__WBP_Template_PopupSecondary_02_PF_Confirm_Button_K2Node_ComponentBoundEvent_5_ButtonClicked__DelegateSignature();
	void BndEvt__WBP_Template_PopupSecondary_02_PF_Confirm_Button_K2Node_ComponentBoundEvent_7_ButtonHovered__DelegateSignature();
	void Cancel__DelegateSignature();
	void Confirm__DelegateSignature();
	void ExecuteUbergraph_WBP_Template_PopupSecondary_02_PF(int32 EntryPoint, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable_1, ESlateVisibility Temp_byte_Variable_2, ESlateVisibility Temp_byte_Variable_3, bool K2Node_Event_IsDesignTime, class USizeBoxSlot* CallFunc_SlotAsSizeBoxSlot_ReturnValue, ESlateVisibility K2Node_Select_Default, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1, ESlateVisibility Temp_byte_Variable_4, ESlateVisibility K2Node_Select_Default_1, class UOverlaySlot* CallFunc_SlotAsOverlaySlot_ReturnValue, ESlateVisibility Temp_byte_Variable_5, bool Temp_bool_Variable_2, int32 CallFunc_AkEventGlobal_ReturnValue_2, ESlateVisibility K2Node_Select_Default_2);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void PrimaryAction__DelegateSignature();
	void SecondaryAction__DelegateSignature();
	void SetActionButtonsState(bool NewLocalVar, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable_2, ESlateVisibility Temp_byte_Variable_3, ESlateVisibility K2Node_Select_Default, bool Temp_bool_Variable_1, ESlateVisibility K2Node_Select_Default_1);
	void SetConfirmEnabled(bool bEnable);
	void SetHeaderText(class FText Param_HeaderText);
	void SetupInputAction(class UOverlaySlot* CallFunc_SlotAsOverlaySlot_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3);
	void UpdateButtonsState(bool Temp_bool_Variable, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable_1, ESlateVisibility Temp_byte_Variable_2, ESlateVisibility Temp_byte_Variable_3, bool Temp_bool_Variable_2, ESlateVisibility Temp_byte_Variable_4, ESlateVisibility Temp_byte_Variable_5, bool Temp_bool_Variable_3, ESlateVisibility Temp_byte_Variable_6, ESlateVisibility Temp_byte_Variable_7, bool Temp_bool_Variable_4, ESlateVisibility Temp_byte_Variable_8, ESlateVisibility Temp_byte_Variable_9, ESlateVisibility K2Node_Select_Default, ESlateVisibility K2Node_Select_Default_1, ESlateVisibility K2Node_Select_Default_2, ESlateVisibility K2Node_Select_Default_3, ESlateVisibility K2Node_Select_Default_4);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Template_PopupSecondary_02_PF_C">();
	}
	static class UWBP_Template_PopupSecondary_02_PF_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Template_PopupSecondary_02_PF_C>();
	}
};
static_assert(alignof(UWBP_Template_PopupSecondary_02_PF_C) == 0x000010, "Wrong alignment on UWBP_Template_PopupSecondary_02_PF_C");
static_assert(sizeof(UWBP_Template_PopupSecondary_02_PF_C) == 0x0004F0, "Wrong size on UWBP_Template_PopupSecondary_02_PF_C");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, UberGraphFrame) == 0x000278, "Member 'UWBP_Template_PopupSecondary_02_PF_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, Button_Primary_Confirm_CM) == 0x000280, "Member 'UWBP_Template_PopupSecondary_02_PF_C::Button_Primary_Confirm_CM' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, Button_Secondary_Cancel_CM) == 0x000288, "Member 'UWBP_Template_PopupSecondary_02_PF_C::Button_Secondary_Cancel_CM' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, Button_Secondary_PrimaryAction_CM) == 0x000290, "Member 'UWBP_Template_PopupSecondary_02_PF_C::Button_Secondary_PrimaryAction_CM' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, Button_Secondary_SecondaryAction_CM) == 0x000298, "Member 'UWBP_Template_PopupSecondary_02_PF_C::Button_Secondary_SecondaryAction_CM' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, Buttons) == 0x0002A0, "Member 'UWBP_Template_PopupSecondary_02_PF_C::Buttons' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, NamedSlot_Body) == 0x0002A8, "Member 'UWBP_Template_PopupSecondary_02_PF_C::NamedSlot_Body' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, WBP_TopBacker_Popup) == 0x0002B0, "Member 'UWBP_Template_PopupSecondary_02_PF_C::WBP_TopBacker_Popup' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, Cancel) == 0x0002B8, "Member 'UWBP_Template_PopupSecondary_02_PF_C::Cancel' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, Confirm) == 0x0002C8, "Member 'UWBP_Template_PopupSecondary_02_PF_C::Confirm' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, Primary_Button_Text) == 0x0002D8, "Member 'UWBP_Template_PopupSecondary_02_PF_C::Primary_Button_Text' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, SecondaryButtonText) == 0x0002F0, "Member 'UWBP_Template_PopupSecondary_02_PF_C::SecondaryButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, HeaderText) == 0x000308, "Member 'UWBP_Template_PopupSecondary_02_PF_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, OnlyConfirm) == 0x000320, "Member 'UWBP_Template_PopupSecondary_02_PF_C::OnlyConfirm' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, OnlyCancel) == 0x000321, "Member 'UWBP_Template_PopupSecondary_02_PF_C::OnlyCancel' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, NoButtons) == 0x000322, "Member 'UWBP_Template_PopupSecondary_02_PF_C::NoButtons' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, ContentPadding) == 0x000324, "Member 'UWBP_Template_PopupSecondary_02_PF_C::ContentPadding' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, ButtonConfirmStyleOverride) == 0x000338, "Member 'UWBP_Template_PopupSecondary_02_PF_C::ButtonConfirmStyleOverride' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, ButtonCancelStyleOverride) == 0x000340, "Member 'UWBP_Template_PopupSecondary_02_PF_C::ButtonCancelStyleOverride' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, TextStyle_ButtonPrimary) == 0x000348, "Member 'UWBP_Template_PopupSecondary_02_PF_C::TextStyle_ButtonPrimary' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, TextStyle_ButtonPrimaryPressed) == 0x000350, "Member 'UWBP_Template_PopupSecondary_02_PF_C::TextStyle_ButtonPrimaryPressed' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, TextStyle_ButtonSecondary) == 0x000358, "Member 'UWBP_Template_PopupSecondary_02_PF_C::TextStyle_ButtonSecondary' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, Ak_Button_Confirm_Click) == 0x000360, "Member 'UWBP_Template_PopupSecondary_02_PF_C::Ak_Button_Confirm_Click' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, Ak_Button_Cancel_Click) == 0x000368, "Member 'UWBP_Template_PopupSecondary_02_PF_C::Ak_Button_Cancel_Click' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, Ak_Button_Cancel_Hover) == 0x000370, "Member 'UWBP_Template_PopupSecondary_02_PF_C::Ak_Button_Cancel_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, Ak_Button_Confirm_Hover) == 0x000378, "Member 'UWBP_Template_PopupSecondary_02_PF_C::Ak_Button_Confirm_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, Ak_Popup_Construct) == 0x000380, "Member 'UWBP_Template_PopupSecondary_02_PF_C::Ak_Popup_Construct' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, CancelIconOverride) == 0x000390, "Member 'UWBP_Template_PopupSecondary_02_PF_C::CancelIconOverride' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, ConfirmInputAction) == 0x000460, "Member 'UWBP_Template_PopupSecondary_02_PF_C::ConfirmInputAction' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, CancelInputAction) == 0x000468, "Member 'UWBP_Template_PopupSecondary_02_PF_C::CancelInputAction' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, IsShowPrimaryActionButton) == 0x000470, "Member 'UWBP_Template_PopupSecondary_02_PF_C::IsShowPrimaryActionButton' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, IsShowSecondaryActionButton) == 0x000471, "Member 'UWBP_Template_PopupSecondary_02_PF_C::IsShowSecondaryActionButton' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, PrimaryActionButtonText) == 0x000478, "Member 'UWBP_Template_PopupSecondary_02_PF_C::PrimaryActionButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, SecondaryActionButtonText) == 0x000490, "Member 'UWBP_Template_PopupSecondary_02_PF_C::SecondaryActionButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, PrimaryAction_InputAction) == 0x0004A8, "Member 'UWBP_Template_PopupSecondary_02_PF_C::PrimaryAction_InputAction' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, PrimaryAction) == 0x0004B0, "Member 'UWBP_Template_PopupSecondary_02_PF_C::PrimaryAction' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, SecondaryAction) == 0x0004C0, "Member 'UWBP_Template_PopupSecondary_02_PF_C::SecondaryAction' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, PrimaryAction_ShowImage) == 0x0004D0, "Member 'UWBP_Template_PopupSecondary_02_PF_C::PrimaryAction_ShowImage' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, PrimaryAction_BoundButton) == 0x0004D1, "Member 'UWBP_Template_PopupSecondary_02_PF_C::PrimaryAction_BoundButton' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, SecondaryAction_InputAction) == 0x0004D8, "Member 'UWBP_Template_PopupSecondary_02_PF_C::SecondaryAction_InputAction' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, SecondaryAction_ShowImage) == 0x0004E0, "Member 'UWBP_Template_PopupSecondary_02_PF_C::SecondaryAction_ShowImage' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, SecondaryAction_BoundButton) == 0x0004E1, "Member 'UWBP_Template_PopupSecondary_02_PF_C::SecondaryAction_BoundButton' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, CancelIA_ShowImage) == 0x0004E2, "Member 'UWBP_Template_PopupSecondary_02_PF_C::CancelIA_ShowImage' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, CancelIA_BoundButton) == 0x0004E3, "Member 'UWBP_Template_PopupSecondary_02_PF_C::CancelIA_BoundButton' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, ConfirmIA_ShowImage) == 0x0004E4, "Member 'UWBP_Template_PopupSecondary_02_PF_C::ConfirmIA_ShowImage' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, ConfirmIA_BoundButton) == 0x0004E5, "Member 'UWBP_Template_PopupSecondary_02_PF_C::ConfirmIA_BoundButton' has a wrong offset!");
static_assert(offsetof(UWBP_Template_PopupSecondary_02_PF_C, IsHeaderToLeft) == 0x0004E6, "Member 'UWBP_Template_PopupSecondary_02_PF_C::IsHeaderToLeft' has a wrong offset!");

}

