#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingsPanel_CM

#include "Basic.hpp"

#include "E_CloseKeyRebindMenuType_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonWidgetInputExtended_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SettingsPanel_CM.WBP_SettingsPanel_CM_C
// 0x0070 (0x0550 - 0x04E0)
class UWBP_SettingsPanel_CM_C final  : public UCommonActivatableWidgetInputExtended
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonActionWidget*                    CommonActionWidget_LB;                             // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_RB;                             // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       SwitcherSettings;                                  // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TabHost_Template_Large_CM_C*       TabHost;                                           // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Audio_Settings_CM_C*               WBP_Audio_Settings_CM;                             // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GamepadSettings_CM_C*              WBP_GamepadSettings_CM;                            // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GameplaySettings_CM_C*             WBP_GameplaySettings_CM;                           // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Graphics_Settings_CM_C*            WBP_Graphics_Settings_CM;                          // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KeyboardSettings_CM_C*             WBP_KeyboardSettings_CM;                           // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_PopupMain_02_C*           WBP_Template_PopupMain_02;                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnExitButtonClicked;                               // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   ActiveTabName;                                     // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_SettingsPanel_CM_WBP_Template_PopupMain_02_K2Node_ComponentBoundEvent_1_CloseButton_OnClicked__DelegateSignature();
	void BndEvt__WBP_SettingsPanel_TabHost_K2Node_ComponentBoundEvent_2_OnDifferentActiveTabSet__DelegateSignature(class UVALUI_TabButtonHostBase* TabButtonHost);
	void BP_OnDeactivated();
	void Deactivate_Self();
	void ExecuteUbergraph_WBP_SettingsPanel_CM(int32 EntryPoint, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue, float K2Node_EnhancedInputActionEvent_ElapsedTime, float K2Node_EnhancedInputActionEvent_TriggeredTime, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction, class UInputAction* Temp_object_Variable, bool CallFunc_Conv_InputActionValueToBool_ReturnValue, double Temp_real_Variable, double Temp_real_Variable_1, double Temp_real_Variable_0, double Temp_real_Variable_1_0, bool Temp_bool_Variable, class UWBP_GraphicsSettings_UnappliedChangesWindow_CM_C* CallFunc_Create_ReturnValue, class UWBP_GraphicsSettings_RestartWindow_CM_C* CallFunc_Create_ReturnValue_1, class UVALUI_TabButtonHostBase* K2Node_ComponentBoundEvent_TabButtonHost, int32 CallFunc_AkEventGlobal_ReturnValue, class FName CallFunc_GetActiveTabName_ReturnValue, bool K2Node_Event_IsDesignTime, const struct FVALUI_InstantiatedTabButtonInfo& CallFunc_TryGetTabInfo_OutInfo, bool CallFunc_TryGetTabInfo_ReturnValue, class FName CallFunc_GetActiveTabName_ReturnValue_1, const struct FVALUI_InstantiatedTabButtonInfo& CallFunc_TryGetTabInfo_OutInfo_1, bool CallFunc_TryGetTabInfo_ReturnValue_1, class UCommonActivatableWidgetInputExtended* K2Node_DynamicCast_AsCommon_Activatable_Widget_Input_Extended, bool K2Node_DynamicCast_bSuccess, TDelegate<void(E_CloseKeyRebindMenuType ExcuteStatus, class UWidget* InWidget)> K2Node_CreateDelegate_OutputDelegate, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, bool Temp_bool_Variable_1, double Temp_real_Variable_2, bool CallFunc_HasUnappliedWindowChanges_Value, double Temp_real_Variable_3, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_2, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_1, bool CallFunc_IsRestartSuggested_Value, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue_1, class UInputAction* Temp_object_Variable_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_3, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue_1, float K2Node_EnhancedInputActionEvent_ElapsedTime_1, float K2Node_EnhancedInputActionEvent_TriggeredTime_1, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction_1, double Temp_real_Variable_3_0, double Temp_real_Variable_2_0, bool CallFunc_Conv_InputActionValueToBool_ReturnValue_1, bool CallFunc_PreswitchCheckforKeyRebindPage_bCloseSuccessed, bool CallFunc_Handing_Input_Action_Switch_Tab_ChangeTab, class FName CallFunc_Handing_Input_Action_Switch_Tab_ActiveTabName, bool CallFunc_Handing_Input_Action_Switch_Tab_ChangeTab_1, class FName CallFunc_Handing_Input_Action_Switch_Tab_ActiveTabName_1, bool CallFunc_PreswitchCheckforKeyRebindPage_bCloseSuccessed_1, bool CallFunc_PreswitchCheckforKeyRebindPage_bCloseSuccessed_2, E_CloseKeyRebindMenuType K2Node_CustomEvent_ExcuteStatus, class UWidget* K2Node_CustomEvent_InWidget, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_TrySetActiveTabName_ReturnValue, bool CallFunc_TrySetActiveTabName_ReturnValue_1);
	void Handing_Input_Action_Switch_Tab(bool bLeftSwitch, bool* ChangeTab, class FName* Param_ActiveTabName, int32 NextIndex, TArray<class FName>& CallFunc_GetTabNames_ReturnValue, class FName CallFunc_Array_Get_Item, class FName CallFunc_GetActiveTabName_ReturnValue, TArray<class FName>& CallFunc_GetTabNames_ReturnValue_1, bool CallFunc_Array_IsValidIndex_ReturnValue, int32 CallFunc_Array_Find_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue);
	void HasUnappliedWindowChanges(bool* Value, bool CallFunc_HasUnappliedWindowChanges_Value);
	void InpActEvt_IA_UI_PrimaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void InpActEvt_IA_UI_PrimaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void IsRestartSuggested(bool* Value, bool CallFunc_IsRestartSuggested_Value);
	void OnCancel();
	void OnConfirm__WBP_Graphic_Settings_Restart_();
	void OnConfirm__WBP_Graphic_Settings_Unapplied_();
	void OnExitButtonClicked__DelegateSignature();
	void OnKeyRebindConfirmExit(E_CloseKeyRebindMenuType ExcuteStatus, class UWidget* InWidget);
	void PreConstruct(bool IsDesignTime);
	void PreswitchCheckforKeyRebindPage(E_CloseKeyRebindMenuType ExcuteStatus, bool* bCloseSuccessed, class UWidget* CallFunc_GetActiveWidget_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_CheckandCloseKeyRebindMenu_bCloseSuccessed);
	void ResetRestartSuggestion();

	class UWidget* BP_GetDesiredFocusTarget(class UWidget* CallFunc_GetDesiredFocusTarget_ReturnValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SettingsPanel_CM_C">();
	}
	static class UWBP_SettingsPanel_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SettingsPanel_CM_C>();
	}
};
static_assert(alignof(UWBP_SettingsPanel_CM_C) == 0x000008, "Wrong alignment on UWBP_SettingsPanel_CM_C");
static_assert(sizeof(UWBP_SettingsPanel_CM_C) == 0x000550, "Wrong size on UWBP_SettingsPanel_CM_C");
static_assert(offsetof(UWBP_SettingsPanel_CM_C, UberGraphFrame) == 0x0004E0, "Member 'UWBP_SettingsPanel_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsPanel_CM_C, CommonActionWidget_LB) == 0x0004E8, "Member 'UWBP_SettingsPanel_CM_C::CommonActionWidget_LB' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsPanel_CM_C, CommonActionWidget_RB) == 0x0004F0, "Member 'UWBP_SettingsPanel_CM_C::CommonActionWidget_RB' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsPanel_CM_C, SwitcherSettings) == 0x0004F8, "Member 'UWBP_SettingsPanel_CM_C::SwitcherSettings' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsPanel_CM_C, TabHost) == 0x000500, "Member 'UWBP_SettingsPanel_CM_C::TabHost' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsPanel_CM_C, WBP_Audio_Settings_CM) == 0x000508, "Member 'UWBP_SettingsPanel_CM_C::WBP_Audio_Settings_CM' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsPanel_CM_C, WBP_GamepadSettings_CM) == 0x000510, "Member 'UWBP_SettingsPanel_CM_C::WBP_GamepadSettings_CM' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsPanel_CM_C, WBP_GameplaySettings_CM) == 0x000518, "Member 'UWBP_SettingsPanel_CM_C::WBP_GameplaySettings_CM' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsPanel_CM_C, WBP_Graphics_Settings_CM) == 0x000520, "Member 'UWBP_SettingsPanel_CM_C::WBP_Graphics_Settings_CM' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsPanel_CM_C, WBP_KeyboardSettings_CM) == 0x000528, "Member 'UWBP_SettingsPanel_CM_C::WBP_KeyboardSettings_CM' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsPanel_CM_C, WBP_Template_PopupMain_02) == 0x000530, "Member 'UWBP_SettingsPanel_CM_C::WBP_Template_PopupMain_02' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsPanel_CM_C, OnExitButtonClicked) == 0x000538, "Member 'UWBP_SettingsPanel_CM_C::OnExitButtonClicked' has a wrong offset!");
static_assert(offsetof(UWBP_SettingsPanel_CM_C, ActiveTabName) == 0x000548, "Member 'UWBP_SettingsPanel_CM_C::ActiveTabName' has a wrong offset!");

}

