#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HotBarRowTick_PF

#include "Basic.hpp"

#include "CommonUI_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HotBarRowTick_PF.WBP_HotBarRowTick_PF_C
// 0x0048 (0x02E8 - 0x02A0)
class UWBP_HotBarRowTick_PF_C final  : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 CarouselDot_Large;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              CarouselDot_SmallButton;                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_31;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_187;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          PreventSpamBeginPlay;                              // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4637[0x7];                                     // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnRowTickTouched;                                  // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         RowTickNumber;                                     // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WBP_HotBarRowTick_PF_CarouselDot_SmallButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_HotBarRowTick_PF(int32 EntryPoint, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button);
	void OnRowTickTouched__DelegateSignature(int32 Param_RowTickNumber, class UWBP_HotBarRowTick_PF_C* RowTick);
	void SetRowTickNumber(int32 SlotNumber);
	void Toggle(bool IsOn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HotBarRowTick_PF_C">();
	}
	static class UWBP_HotBarRowTick_PF_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HotBarRowTick_PF_C>();
	}
};
static_assert(alignof(UWBP_HotBarRowTick_PF_C) == 0x000008, "Wrong alignment on UWBP_HotBarRowTick_PF_C");
static_assert(sizeof(UWBP_HotBarRowTick_PF_C) == 0x0002E8, "Wrong size on UWBP_HotBarRowTick_PF_C");
static_assert(offsetof(UWBP_HotBarRowTick_PF_C, UberGraphFrame) == 0x0002A0, "Member 'UWBP_HotBarRowTick_PF_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HotBarRowTick_PF_C, CarouselDot_Large) == 0x0002A8, "Member 'UWBP_HotBarRowTick_PF_C::CarouselDot_Large' has a wrong offset!");
static_assert(offsetof(UWBP_HotBarRowTick_PF_C, CarouselDot_SmallButton) == 0x0002B0, "Member 'UWBP_HotBarRowTick_PF_C::CarouselDot_SmallButton' has a wrong offset!");
static_assert(offsetof(UWBP_HotBarRowTick_PF_C, Image_31) == 0x0002B8, "Member 'UWBP_HotBarRowTick_PF_C::Image_31' has a wrong offset!");
static_assert(offsetof(UWBP_HotBarRowTick_PF_C, WidgetSwitcher_187) == 0x0002C0, "Member 'UWBP_HotBarRowTick_PF_C::WidgetSwitcher_187' has a wrong offset!");
static_assert(offsetof(UWBP_HotBarRowTick_PF_C, PreventSpamBeginPlay) == 0x0002C8, "Member 'UWBP_HotBarRowTick_PF_C::PreventSpamBeginPlay' has a wrong offset!");
static_assert(offsetof(UWBP_HotBarRowTick_PF_C, OnRowTickTouched) == 0x0002D0, "Member 'UWBP_HotBarRowTick_PF_C::OnRowTickTouched' has a wrong offset!");
static_assert(offsetof(UWBP_HotBarRowTick_PF_C, RowTickNumber) == 0x0002E0, "Member 'UWBP_HotBarRowTick_PF_C::RowTickNumber' has a wrong offset!");

}

